
                        DC Professional (TM)
                           DC Expert (TM)
                            DC Ultra (TM)
                       FloorPlan Manager (TM)
                          HDL Compiler (TM)
                         VHDL Compiler (TM)
                        Library Compiler (TM)
                      DesignWare Developer (TM)
                          DFT Compiler (TM)
                            BSD Compiler
                         Power Compiler (TM)

           Version D-2010.03-SP3 for linux -- Jul 18, 2010
              Copyright (c) 1988-2010 by Synopsys, Inc.
                         ALL RIGHTS RESERVED

This software and the associated documentation are confidential and 
proprietary to Synopsys, Inc. Your use or disclosure of this software 
is subject to the terms and conditions of a written license agreement 
between you, or your company, and Synopsys, Inc.

The above trademark notice does not imply that you are licensed to use 
all of the listed products. You are licensed to use only those products 
for which you have lawfully obtained a valid license key.

Initializing...
Error: Current design is not defined. (UID-4)
Information: Defining new variable 'design_name'. (CMD-041)
dc_shell> mcac
Information: Defining new variable 'my_type'. (CMD-041)
dc_shell> _rtl
Information: Defining new variable 'my_max_area'. (CMD-041)
dc_shell> 0
Information: Defining new variable 'my_compile_effort'. (CMD-041)
dc_shell> high
Information: Variable 'hdlin_enable_presto' is obsolete and is being ignored. (INFO-100)
Information: Variable 'hdlin_enable_presto' is obsolete and is being ignored. (INFO-100)
dc_shell> TRUE
dc_shell> all
dc_shell> %s[%d]
dc_shell> %s[%d]
Error: Current design is not defined. (UID-4)
dc_shell> 0
dc_shell> true
dc_shell> 1
dc_shell> 1
dc_shell> 1
dc_shell> Verilog
Information: Defining new variable 'tsmc18'. (CMD-041)
dc_shell> /classes/eeee720/maieee/lib/tsmc-0.18/synopsys
Information: Defining new variable 'stdcells5u'. (CMD-041)
dc_shell> ../../lib/tech/synopsys
dc_shell> . /tools/synopsys/syn/current/libraries/syn /classes/eeee720/maieee/lib/tsmc-0.18/synopsys ./include ./src
dc_shell> 1
Information: Defining new variable 'report_dir'. (CMD-041)
dc_shell> ./report/dc/
Information: Variable 'hdlin_use_cin' is obsolete and is being ignored. (INFO-100)
dc_shell> true
Information: Defining new variable 'synlib_model_map_effort'. (CMD-041)
dc_shell> high
Information: Defining new variable 'hdlout_uses_internal_busses'. (CMD-041)
dc_shell> true
dc_shell> true
Information: Defining new variable 'tech_lib'. (CMD-041)
dc_shell> _tsmc18
dc_shell> typical
dc_shell> typical.db
dc_shell> * typical.db dw_foundation.sldb standard.sldb
dc_shell> DesignWare
dc_shell> 
Reading Verilog Source Files

Loading db file '/classes/eeee720/maieee/lib/tsmc-0.18/synopsys/typical.db'
Loading db file '/tools/synopsys/syn/current/libraries/syn/dw_foundation.sldb'
Loading db file '/tools/synopsys/syn/current/libraries/syn/standard.sldb'
Loading db file '/tools/synopsys/syn/current/libraries/syn/gtech.db'
  Loading link library 'typical'
  Loading link library 'gtech'
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/src/mcac.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Performing 'read' command.
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/mcac/src/mcac.v
Reading with netlist reader (equivalent to -netlist option).
Verilog netlist reader completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/mcac/src/mcac.db:mcac'
Loaded 1 design.
Current design is 'mcac'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/enc/src/enc.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Performing 'read' command.
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/enc/src/enc.v
Warning:  /home/pi4810/eeee720/proj/mcac_bs/enc/src/enc.v:121: the undeclared symbol 'inv_ch_clk_in' assumed to have the default net type, which is 'wire'. (VER-936)
Warning:  /home/pi4810/eeee720/proj/mcac_bs/enc/src/enc.v:166: the undeclared symbol 'fa_start' assumed to have the default net type, which is 'wire'. (VER-936)
Warning:  /home/pi4810/eeee720/proj/mcac_bs/enc/src/enc.v:258: the undeclared symbol 'enc_fs_buffin' assumed to have the default net type, which is 'wire'. (VER-936)
Reading with netlist reader (equivalent to -netlist option).
Verilog netlist reader completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/enc/src/enc.db:enc'
Loaded 1 design.
Current design is 'enc'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/dec/src/dec.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Performing 'read' command.
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/dec/src/dec.v
Warning:  /home/pi4810/eeee720/proj/mcac_bs/dec/src/dec.v:141: the undeclared symbol 'fa_start' assumed to have the default net type, which is 'wire'. (VER-936)
Warning:  /home/pi4810/eeee720/proj/mcac_bs/dec/src/dec.v:245: the undeclared symbol 'wr_clk' assumed to have the default net type, which is 'wire'. (VER-936)
Warning:  /home/pi4810/eeee720/proj/mcac_bs/dec/src/dec.v:245: the undeclared symbol 'rd_clk' assumed to have the default net type, which is 'wire'. (VER-936)
Reading with netlist reader (equivalent to -netlist option).
Verilog netlist reader completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/dec/src/dec.db:dec'
Loaded 1 design.
Current design is 'dec'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/enc/src/IN_REG.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/enc/src/IN_REG.v

Inferred memory devices in process
	in routine IN_REG line 42 in file
		'/home/pi4810/eeee720/proj/mcac_bs/enc/src/IN_REG.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|    data_out_reg     | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/enc/src/IN_REG.db:IN_REG'
Loaded 1 design.
Current design is 'IN_REG'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/EXPAND/src/EXPAND.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/EXPAND/src/EXPAND.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/EXPAND/src/EXPAND.db:EXPAND'
Loaded 1 design.
Current design is 'EXPAND'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/SUBTA/src/SUBTA.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/SUBTA/src/SUBTA.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/SUBTA/src/SUBTA.db:SUBTA'
Loaded 1 design.
Current design is 'SUBTA'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/I_ADAP_QUAN/src/I_ADAP_QUAN.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Performing 'read' command.
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/I_ADAP_QUAN/src/I_ADAP_QUAN.v
Reading with netlist reader (equivalent to -netlist option).
Verilog netlist reader completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/I_ADAP_QUAN/src/I_ADAP_QUAN.db:I_ADAP_QUAN'
Loaded 1 design.
Current design is 'I_ADAP_QUAN'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/ADAP_PRED_REC_SIG/src/ADAP_PRED_REC_SIG.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/ADAP_PRED_REC_SIG/src/ADAP_PRED_REC_SIG.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/ADAP_PRED_REC_SIG/src/ADAP_PRED_REC_SIG.db:ADAP_PRED_REC_SIG'
Loaded 1 design.
Current design is 'ADAP_PRED_REC_SIG'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/QUAN_SCAL_FAC_ADAP/src/QUAN_SCAL_FAC_ADAP.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/QUAN_SCAL_FAC_ADAP/src/QUAN_SCAL_FAC_ADAP.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/QUAN_SCAL_FAC_ADAP/src/QUAN_SCAL_FAC_ADAP.db:QUAN_SCAL_FAC_ADAP'
Loaded 1 design.
Current design is 'QUAN_SCAL_FAC_ADAP'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/ADAP_SPED_CTL/src/ADAP_SPED_CTL.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/ADAP_SPED_CTL/src/ADAP_SPED_CTL.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/ADAP_SPED_CTL/src/ADAP_SPED_CTL.db:ADAP_SPED_CTL'
Loaded 1 design.
Current design is 'ADAP_SPED_CTL'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/TON_TRAN_DET/src/TON_TRAN_DET.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/TON_TRAN_DET/src/TON_TRAN_DET.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/TON_TRAN_DET/src/TON_TRAN_DET.db:TON_TRAN_DET'
Loaded 1 design.
Current design is 'TON_TRAN_DET'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/ACCUM/src/ACCUM.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/ACCUM/src/ACCUM.v

Inferred memory devices in process
	in routine ACCUM line 48 in file
		'/home/pi4810/eeee720/proj/mcac_bs/ACCUM/src/ACCUM.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     m1_out_reg      | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================

Inferred memory devices in process
	in routine ACCUM line 57 in file
		'/home/pi4810/eeee720/proj/mcac_bs/ACCUM/src/ACCUM.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|      tmp1_reg       | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================

Inferred memory devices in process
	in routine ACCUM line 73 in file
		'/home/pi4810/eeee720/proj/mcac_bs/ACCUM/src/ACCUM.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|      sezi_reg       | Flip-flop |  15   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================

Inferred memory devices in process
	in routine ACCUM line 79 in file
		'/home/pi4810/eeee720/proj/mcac_bs/ACCUM/src/ACCUM.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|       sei_reg       | Flip-flop |  15   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/ACCUM/src/ACCUM.db:ACCUM'
Loaded 1 design.
Current design is 'ACCUM'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/ADAP_QUAN/src/ADAP_QUAN.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Performing 'read' command.
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/ADAP_QUAN/src/ADAP_QUAN.v
Reading with netlist reader (equivalent to -netlist option).
Verilog netlist reader completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/ADAP_QUAN/src/ADAP_QUAN.db:ADAP_QUAN'
Loaded 1 design.
Current design is 'ADAP_QUAN'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/ADDA/src/ADDA.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/ADDA/src/ADDA.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/ADDA/src/ADDA.db:ADDA'
Loaded 1 design.
Current design is 'ADDA'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/ADDB/src/ADDB.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/ADDB/src/ADDB.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/ADDB/src/ADDB.db:ADDB'
Loaded 1 design.
Current design is 'ADDB'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/ADDC/src/ADDC.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/ADDC/src/ADDC.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/ADDC/src/ADDC.db:ADDC'
Loaded 1 design.
Current design is 'ADDC'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/ANTILOG/src/ANTILOG.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/ANTILOG/src/ANTILOG.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/ANTILOG/src/ANTILOG.db:ANTILOG'
Loaded 1 design.
Current design is 'ANTILOG'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/COMPRESS/src/COMPRESS.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/COMPRESS/src/COMPRESS.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/COMPRESS/src/COMPRESS.db:COMPRESS'
Loaded 1 design.
Current design is 'COMPRESS'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/CU/src/CU.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/CU/src/CU.v
Warning:  /home/pi4810/eeee720/proj/mcac_bs/CU/src/CU.v:89: Port RF_WR_ADDR is implicitly typed  (VER-987)
Warning:  /home/pi4810/eeee720/proj/mcac_bs/CU/src/CU.v:89: Port RF_RD_ADDR is implicitly typed  (VER-987)

Inferred memory devices in process
	in routine CU line 114 in file
		'/home/pi4810/eeee720/proj/mcac_bs/CU/src/CU.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   IN_WAIT_CNT_reg   | Flip-flop |   5   |  Y  | N  | Y  | N  | N  | N  | N  |
|  IN_WAIT_STATE_reg  | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|    FA_start_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================

Inferred memory devices in process
	in routine CU line 146 in file
		'/home/pi4810/eeee720/proj/mcac_bs/CU/src/CU.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
| out_wait_state_reg  | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|   RF_in_state_reg   | Flip-flop |   3   |  Y  | N  | Y  | N  | N  | N  | N  |
| delay_strobe_r_reg  | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|     RF_WR_r_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|  OUT_WAIT_CNT_reg   | Flip-flop |   5   |  Y  | N  | N  | N  | N  | N  | N  |
===============================================================================

Inferred memory devices in process
	in routine CU line 197 in file
		'/home/pi4810/eeee720/proj/mcac_bs/CU/src/CU.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     RF_RD_r_reg     | Flip-flop |   1   |  N  | N  | N  | N  | N  | N  | N  |
| OUT_WRITE_STATE_reg | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================

Inferred memory devices in process
	in routine CU line 217 in file
		'/home/pi4810/eeee720/proj/mcac_bs/CU/src/CU.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|  RF_STATE_OUT_reg   | Flip-flop |   3   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/CU/src/CU.db:CU'
Loaded 1 design.
Current design is 'CU'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/DELAY/src/DELAY.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/DELAY/src/DELAY.v

Inferred memory devices in process
	in routine DELAY line 81 in file
		'/home/pi4810/eeee720/proj/mcac_bs/DELAY/src/DELAY.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     delay0_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay7_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay6_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay5_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay4_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay3_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay2_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay1_reg      | Flip-flop |   2   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/DELAY/src/DELAY.db:DELAY'
Loaded 1 design.
Current design is 'DELAY'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/DELAYPREDIC/src/DELAYPREDIC.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/DELAYPREDIC/src/DELAYPREDIC.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/DELAYPREDIC/src/DELAYPREDIC.db:DELAYPREDIC'
Loaded 1 design.
Current design is 'DELAYPREDIC'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/FILTA/src/FILTA.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/FILTA/src/FILTA.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/FILTA/src/FILTA.db:FILTA'
Loaded 1 design.
Current design is 'FILTA'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/FILTB/src/FILTB.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/FILTB/src/FILTB.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/FILTB/src/FILTB.db:FILTB'
Loaded 1 design.
Current design is 'FILTB'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/FILTC/src/FILTC.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/FILTC/src/FILTC.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/FILTC/src/FILTC.db:FILTC'
Loaded 1 design.
Current design is 'FILTC'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/FILTD/src/FILTD.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/FILTD/src/FILTD.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/FILTD/src/FILTD.db:FILTD'
Loaded 1 design.
Current design is 'FILTD'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/FILTE/src/FILTE.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/FILTE/src/FILTE.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/FILTE/src/FILTE.db:FILTE'
Loaded 1 design.
Current design is 'FILTE'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/FLOATA/src/FLOATA.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/FLOATA/src/FLOATA.v
Warning:  /home/pi4810/eeee720/proj/mcac_bs/FLOATA/src/FLOATA.v:58: signed to unsigned assignment occurs. (VER-318)
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/FLOATA/src/FLOATA.db:FLOATA'
Loaded 1 design.
Current design is 'FLOATA'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/FLOATB/src/FLOATB.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/FLOATB/src/FLOATB.v
Warning:  /home/pi4810/eeee720/proj/mcac_bs/FLOATB/src/FLOATB.v:55: signed to unsigned assignment occurs. (VER-318)
Warning:  /home/pi4810/eeee720/proj/mcac_bs/FLOATB/src/FLOATB.v:73: signed to unsigned conversion occurs. (VER-318)
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/FLOATB/src/FLOATB.db:FLOATB'
Loaded 1 design.
Current design is 'FLOATB'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/FMULT/src/FMULT.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/FMULT/src/FMULT.v

Inferred memory devices in process
	in routine FMULT line 164 in file
		'/home/pi4810/eeee720/proj/mcac_bs/FMULT/src/FMULT.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|    AnEXP_reg_reg    | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
|   SRnEXP_reg_reg    | Flip-flop |   4   |  Y  | N  | Y  | N  | N  | N  | N  |
|   WAnEXP_reg_reg    | Flip-flop |   5   |  Y  | N  | Y  | N  | N  | N  | N  |
|    EXP_CARRY_reg    | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================

Inferred memory devices in process
	in routine FMULT line 198 in file
		'/home/pi4810/eeee720/proj/mcac_bs/FMULT/src/FMULT.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|   AnMANT_reg_reg    | Flip-flop |   6   |  Y  | N  | Y  | N  | N  | N  | N  |
|  WAnMANT_rege_reg   | Flip-flop |  13   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================

Inferred memory devices in process
	in routine FMULT line 247 in file
		'/home/pi4810/eeee720/proj/mcac_bs/FMULT/src/FMULT.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     WAn_reg_reg     | Flip-flop |  15   |  Y  | N  | Y  | N  | N  | N  | N  |
|     WAn_reg_reg     | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/FMULT/src/FMULT.db:FMULT'
Loaded 1 design.
Current design is 'FMULT'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/FMULT_ACCUM/src/FMULT_ACCUM.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/FMULT_ACCUM/src/FMULT_ACCUM.v
Warning:  /home/pi4810/eeee720/proj/mcac_bs/FMULT_ACCUM/src/FMULT_ACCUM.v:135: DEFAULT branch of CASE statement cannot be reached. (ELAB-311)
Warning:  /home/pi4810/eeee720/proj/mcac_bs/FMULT_ACCUM/src/FMULT_ACCUM.v:149: DEFAULT branch of CASE statement cannot be reached. (ELAB-311)

Statistics for case statements in always block at line 133 in file
	'/home/pi4810/eeee720/proj/mcac_bs/FMULT_ACCUM/src/FMULT_ACCUM.v'
===============================================
|           Line           |  full/ parallel  |
===============================================
|           135            |    auto/auto     |
===============================================

Statistics for case statements in always block at line 147 in file
	'/home/pi4810/eeee720/proj/mcac_bs/FMULT_ACCUM/src/FMULT_ACCUM.v'
===============================================
|           Line           |  full/ parallel  |
===============================================
|           149            |    auto/auto     |
===============================================

Inferred memory devices in process
	in routine FMULT_ACCUM line 168 in file
		'/home/pi4810/eeee720/proj/mcac_bs/FMULT_ACCUM/src/FMULT_ACCUM.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
| SHIFT_MANT_int_reg  | Flip-flop |   1   |  N  | N  | N  | N  | N  | N  | N  |
|  LD_OUT_SR_int_reg  | Flip-flop |   1   |  N  | N  | N  | N  | N  | N  | N  |
|   INIT_SR_int_reg   | Flip-flop |   1   |  N  | N  | N  | N  | N  | N  | N  |
|    CLR_ACCUM_reg    | Flip-flop |   1   |  N  | N  | N  | N  | N  | N  | N  |
|    CLR_CARRY_reg    | Flip-flop |   1   |  N  | N  | N  | N  | N  | N  | N  |
|     LD_SEZI_reg     | Flip-flop |   1   |  N  | N  | N  | N  | N  | N  | N  |
|     mux_sel_reg     | Flip-flop |   3   |  Y  | N  | Y  | N  | N  | N  | N  |
|      done_reg       | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|      count_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
|     LD_SEI_reg      | Flip-flop |   1   |  N  | N  | N  | N  | N  | N  | N  |
|  SHIFT_EXP_int_reg  | Flip-flop |   1   |  N  | N  | N  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/FMULT_ACCUM/src/FMULT_ACCUM.db:FMULT_ACCUM'
Loaded 1 design.
Current design is 'FMULT_ACCUM'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/FUNCTF/src/FUNCTF.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/FUNCTF/src/FUNCTF.v

Statistics for case statements in always block at line 52 in file
	'/home/pi4810/eeee720/proj/mcac_bs/FUNCTF/src/FUNCTF.v'
===============================================
|           Line           |  full/ parallel  |
===============================================
|            54            |    auto/auto     |
|            57            |    auto/auto     |
|            65            |    auto/auto     |
===============================================
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/FUNCTF/src/FUNCTF.db:FUNCTF'
Loaded 1 design.
Current design is 'FUNCTF'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/FUNCTW/src/FUNCTW.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/FUNCTW/src/FUNCTW.v

Statistics for case statements in always block at line 50 in file
	'/home/pi4810/eeee720/proj/mcac_bs/FUNCTW/src/FUNCTW.v'
===============================================
|           Line           |  full/ parallel  |
===============================================
|            52            |    auto/auto     |
|            55            |    auto/auto     |
|            63            |    auto/auto     |
===============================================
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/FUNCTW/src/FUNCTW.db:FUNCTW'
Loaded 1 design.
Current design is 'FUNCTW'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/G711/src/G711.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/G711/src/G711.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/G711/src/G711.db:G711'
Loaded 1 design.
Current design is 'G711'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/IG711/src/IG711.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/IG711/src/IG711.v
Warning:  /home/pi4810/eeee720/proj/mcac_bs/IG711/src/IG711.v:55: DEFAULT branch of CASE statement cannot be reached. (ELAB-311)

Statistics for case statements in always block at line 51 in file
	'/home/pi4810/eeee720/proj/mcac_bs/IG711/src/IG711.v'
===============================================
|           Line           |  full/ parallel  |
===============================================
|            52            |    auto/auto     |
|            55            |    auto/auto     |
|            68            |    auto/auto     |
===============================================
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/IG711/src/IG711.db:IG711'
Loaded 1 design.
Current design is 'IG711'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/IN_PCM/src/IN_PCM.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Performing 'read' command.
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/IN_PCM/src/IN_PCM.v
Reading with netlist reader (equivalent to -netlist option).
Verilog netlist reader completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/IN_PCM/src/IN_PCM.db:IN_PCM'
Loaded 1 design.
Current design is 'IN_PCM'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/OUT_PCM/src/OUT_PCM.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Performing 'read' command.
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/OUT_PCM/src/OUT_PCM.v
Reading with netlist reader (equivalent to -netlist option).
Verilog netlist reader completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/OUT_PCM/src/OUT_PCM.db:OUT_PCM'
Loaded 1 design.
Current design is 'OUT_PCM'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/LIMA/src/LIMA.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/LIMA/src/LIMA.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/LIMA/src/LIMA.db:LIMA'
Loaded 1 design.
Current design is 'LIMA'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/LIMB/src/LIMB.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/LIMB/src/LIMB.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/LIMB/src/LIMB.db:LIMB'
Loaded 1 design.
Current design is 'LIMB'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/LIMC/src/LIMC.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/LIMC/src/LIMC.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/LIMC/src/LIMC.db:LIMC'
Loaded 1 design.
Current design is 'LIMC'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/LIMD/src/LIMD.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/LIMD/src/LIMD.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/LIMD/src/LIMD.db:LIMD'
Loaded 1 design.
Current design is 'LIMD'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/LOG/src/LOG.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/LOG/src/LOG.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/LOG/src/LOG.db:LOG'
Loaded 1 design.
Current design is 'LOG'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/MIX/src/MIX.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/MIX/src/MIX.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/MIX/src/MIX.db:MIX'
Loaded 1 design.
Current design is 'MIX'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/QUAN/src/QUAN.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/QUAN/src/QUAN.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/QUAN/src/QUAN.db:QUAN'
Loaded 1 design.
Current design is 'QUAN'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/RECONST/src/RECONST.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/RECONST/src/RECONST.v

Statistics for case statements in always block at line 66 in file
	'/home/pi4810/eeee720/proj/mcac_bs/RECONST/src/RECONST.v'
===============================================
|           Line           |  full/ parallel  |
===============================================
|            67            |    auto/auto     |
===============================================
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/RECONST/src/RECONST.db:RECONST'
Loaded 1 design.
Current design is 'RECONST'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/SUBTB/src/SUBTB.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/SUBTB/src/SUBTB.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/SUBTB/src/SUBTB.db:SUBTB'
Loaded 1 design.
Current design is 'SUBTB'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/SUBTC/src/SUBTC.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/SUBTC/src/SUBTC.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/SUBTC/src/SUBTC.db:SUBTC'
Loaded 1 design.
Current design is 'SUBTC'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/SYNC/src/SYNC.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/SYNC/src/SYNC.v

Statistics for case statements in always block at line 55 in file
	'/home/pi4810/eeee720/proj/mcac_bs/SYNC/src/SYNC.v'
===============================================
|           Line           |  full/ parallel  |
===============================================
|            57            |    auto/auto     |
===============================================

Statistics for case statements in always block at line 259 in file
	'/home/pi4810/eeee720/proj/mcac_bs/SYNC/src/SYNC.v'
===============================================
|           Line           |  full/ parallel  |
===============================================
|           269            |    auto/auto     |
|           326            |    auto/auto     |
===============================================
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/SYNC/src/SYNC.db:SYNC'
Loaded 1 design.
Current design is 'SYNC'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/TONE/src/TONE.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/TONE/src/TONE.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/TONE/src/TONE.db:TONE'
Loaded 1 design.
Current design is 'TONE'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/TRANS/src/TRANS.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/TRANS/src/TRANS.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/TRANS/src/TRANS.db:TRANS'
Loaded 1 design.
Current design is 'TRANS'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/TRIGA/src/TRIGA.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/TRIGA/src/TRIGA.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/TRIGA/src/TRIGA.db:TRIGA'
Loaded 1 design.
Current design is 'TRIGA'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/TRIGB/src/TRIGB.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/TRIGB/src/TRIGB.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/TRIGB/src/TRIGB.db:TRIGB'
Loaded 1 design.
Current design is 'TRIGB'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/UPA1/src/UPA1.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/UPA1/src/UPA1.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/UPA1/src/UPA1.db:UPA1'
Loaded 1 design.
Current design is 'UPA1'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/UPA2/src/UPA2.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/UPA2/src/UPA2.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/UPA2/src/UPA2.db:UPA2'
Loaded 1 design.
Current design is 'UPA2'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/UPB/src/UPB.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/UPB/src/UPB.v

Statistics for case statements in always block at line 60 in file
	'/home/pi4810/eeee720/proj/mcac_bs/UPB/src/UPB.v'
===============================================
|           Line           |  full/ parallel  |
===============================================
|            61            |    auto/auto     |
===============================================

Inferred memory devices in process
	in routine UPB line 60 in file
		'/home/pi4810/eeee720/proj/mcac_bs/UPB/src/UPB.v'.
===========================================================================
|    Register Name    | Type  | Width | Bus | MB | AR | AS | SR | SS | ST |
===========================================================================
|      UGBN_reg       | Latch |  16   |  Y  | N  | N  | N  | -  | -  | -  |
===========================================================================
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/UPB/src/UPB.db:UPB'
Loaded 1 design.
Current design is 'UPB'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/XORA/src/XORA.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/XORA/src/XORA.v
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/XORA/src/XORA.db:XORA'
Loaded 1 design.
Current design is 'XORA'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/CLOCK_GEN/src/CLOCK_GEN.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/CLOCK_GEN/src/CLOCK_GEN.v
Warning:  /home/pi4810/eeee720/proj/mcac_bs/CLOCK_GEN/src/CLOCK_GEN.v:60: the undeclared symbol 'FSYNC_PERIOD' assumed to have the default net type, which is 'wire'. (VER-936)

Inferred memory devices in process
	in routine CLOCK_GEN line 61 in file
		'/home/pi4810/eeee720/proj/mcac_bs/CLOCK_GEN/src/CLOCK_GEN.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
| CLK_GEN_COUNTER_reg | Flip-flop |   8   |  Y  | N  | N  | N  | N  | N  | N  |
| ch_clk_out_int_reg  | Flip-flop |   1   |  N  | N  | N  | N  | N  | N  | N  |
|  f_sync_in_int_reg  | Flip-flop |   1   |  N  | N  | N  | N  | N  | N  | N  |
| not_ch_clk_int_reg  | Flip-flop |   1   |  N  | N  | N  | N  | N  | N  | N  |
| f_sync_out_int_reg  | Flip-flop |   1   |  N  | N  | N  | N  | N  | N  | N  |
|  FSYNC_COUNTER_reg  | Flip-flop |   4   |  Y  | N  | N  | N  | N  | N  | N  |
|   FSYNC_STATE_reg   | Flip-flop |   1   |  N  | N  | N  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/CLOCK_GEN/src/CLOCK_GEN.db:CLOCK_GEN'
Loaded 1 design.
Current design is 'CLOCK_GEN'.
Loading verilog file '/home/pi4810/eeee720/proj/mcac_bs/RF/src/RF.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/pi4810/eeee720/proj/mcac_bs/RF/src/RF.v

Statistics for case statements in always block at line 96 in file
	'/home/pi4810/eeee720/proj/mcac_bs/RF/src/RF.v'
===============================================
|           Line           |  full/ parallel  |
===============================================
|            98            |    auto/auto     |
===============================================

Inferred memory devices in process
	in routine RF line 77 in file
		'/home/pi4810/eeee720/proj/mcac_bs/RF/src/RF.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|      reg_w_reg      | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
|      reg_w_reg      | Flip-flop |  56   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================

Inferred memory devices in process
	in routine RF line 111 in file
		'/home/pi4810/eeee720/proj/mcac_bs/RF/src/RF.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|    data_out_reg     | Flip-flop |   8   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Current design is now '/home/pi4810/eeee720/proj/mcac_bs/RF/src/RF.db:RF'
Loaded 1 design.
Current design is 'RF'.
Information: Defining new variable 'all_modules'. (CMD-041)
Information: Defining new variable 'this_module'. (CMD-041)
dc_shell> Current design is 'mcac'.
{mcac}
dc_shell> Current design is 'mcac'.
{mcac}
dc_shell> 
  Linking design 'mcac'
  Using the following designs and libraries:
  --------------------------------------------------------------------------
  * (57 designs)              /home/pi4810/eeee720/proj/mcac_bs/mcac/src/mcac.db, etc
  typical (library)           /classes/eeee720/maieee/lib/tsmc-0.18/synopsys/typical.db
  dw_foundation.sldb (library) /tools/synopsys/syn/current/libraries/syn/dw_foundation.sldb

Information: Building the design 'DELAY' instantiated from design 'ADAP_PRED_REC_SIG' with
	the parameters "WIDTH=1,RESET_STATE=0". (HDL-193)

Inferred memory devices in process
	in routine DELAY_RESET_STATE0_WIDTH1 line 81 in file
		'/home/pi4810/eeee720/proj/mcac_bs/DELAY/src/DELAY.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     delay0_reg      | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|     delay7_reg      | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|     delay6_reg      | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|     delay5_reg      | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|     delay4_reg      | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|     delay3_reg      | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|     delay2_reg      | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|     delay1_reg      | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'DELAY' instantiated from design 'ADAP_PRED_REC_SIG' with
	the parameters "WIDTH=11,RESET_STATE=11'h020". (HDL-193)

Inferred memory devices in process
	in routine DELAY_020_11 line 81 in file
		'/home/pi4810/eeee720/proj/mcac_bs/DELAY/src/DELAY.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     delay0_reg      | Flip-flop |  10   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay0_reg      | Flip-flop |   1   |  N  | N  | N  | Y  | N  | N  | N  |
|     delay7_reg      | Flip-flop |  10   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay7_reg      | Flip-flop |   1   |  N  | N  | N  | Y  | N  | N  | N  |
|     delay6_reg      | Flip-flop |  10   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay6_reg      | Flip-flop |   1   |  N  | N  | N  | Y  | N  | N  | N  |
|     delay5_reg      | Flip-flop |  10   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay5_reg      | Flip-flop |   1   |  N  | N  | N  | Y  | N  | N  | N  |
|     delay4_reg      | Flip-flop |  10   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay4_reg      | Flip-flop |   1   |  N  | N  | N  | Y  | N  | N  | N  |
|     delay3_reg      | Flip-flop |  10   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay3_reg      | Flip-flop |   1   |  N  | N  | N  | Y  | N  | N  | N  |
|     delay2_reg      | Flip-flop |  10   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay2_reg      | Flip-flop |   1   |  N  | N  | N  | Y  | N  | N  | N  |
|     delay1_reg      | Flip-flop |  10   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay1_reg      | Flip-flop |   1   |  N  | N  | N  | Y  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'TRIGB' instantiated from design 'ADAP_PRED_REC_SIG' with
	the parameters "WIDTH=16". (HDL-193)
Presto compilation completed successfully.
Information: Building the design 'DELAY' instantiated from design 'ADAP_PRED_REC_SIG' with
	the parameters "WIDTH=16,RESET_STATE=0". (HDL-193)

Inferred memory devices in process
	in routine DELAY_RESET_STATE0_WIDTH16 line 81 in file
		'/home/pi4810/eeee720/proj/mcac_bs/DELAY/src/DELAY.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     delay0_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay7_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay6_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay5_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay4_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay3_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay2_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay1_reg      | Flip-flop |  16   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'DELAY' instantiated from design 'QUAN_SCAL_FAC_ADAP' with
	the parameters "WIDTH=13,RESET_STATE=13'h0220". (HDL-193)

Inferred memory devices in process
	in routine DELAY_0220_13 line 81 in file
		'/home/pi4810/eeee720/proj/mcac_bs/DELAY/src/DELAY.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     delay0_reg      | Flip-flop |  11   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay0_reg      | Flip-flop |   2   |  Y  | N  | N  | Y  | N  | N  | N  |
|     delay7_reg      | Flip-flop |  11   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay7_reg      | Flip-flop |   2   |  Y  | N  | N  | Y  | N  | N  | N  |
|     delay6_reg      | Flip-flop |  11   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay6_reg      | Flip-flop |   2   |  Y  | N  | N  | Y  | N  | N  | N  |
|     delay5_reg      | Flip-flop |  11   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay5_reg      | Flip-flop |   2   |  Y  | N  | N  | Y  | N  | N  | N  |
|     delay4_reg      | Flip-flop |  11   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay4_reg      | Flip-flop |   2   |  Y  | N  | N  | Y  | N  | N  | N  |
|     delay3_reg      | Flip-flop |  11   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay3_reg      | Flip-flop |   2   |  Y  | N  | N  | Y  | N  | N  | N  |
|     delay2_reg      | Flip-flop |  11   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay2_reg      | Flip-flop |   2   |  Y  | N  | N  | Y  | N  | N  | N  |
|     delay1_reg      | Flip-flop |  11   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay1_reg      | Flip-flop |   2   |  Y  | N  | N  | Y  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'DELAY' instantiated from design 'QUAN_SCAL_FAC_ADAP' with
	the parameters "WIDTH=19,RESET_STATE=19'h08800". (HDL-193)

Inferred memory devices in process
	in routine DELAY_08800_19 line 81 in file
		'/home/pi4810/eeee720/proj/mcac_bs/DELAY/src/DELAY.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     delay0_reg      | Flip-flop |  17   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay0_reg      | Flip-flop |   2   |  Y  | N  | N  | Y  | N  | N  | N  |
|     delay7_reg      | Flip-flop |  17   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay7_reg      | Flip-flop |   2   |  Y  | N  | N  | Y  | N  | N  | N  |
|     delay6_reg      | Flip-flop |  17   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay6_reg      | Flip-flop |   2   |  Y  | N  | N  | Y  | N  | N  | N  |
|     delay5_reg      | Flip-flop |  17   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay5_reg      | Flip-flop |   2   |  Y  | N  | N  | Y  | N  | N  | N  |
|     delay4_reg      | Flip-flop |  17   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay4_reg      | Flip-flop |   2   |  Y  | N  | N  | Y  | N  | N  | N  |
|     delay3_reg      | Flip-flop |  17   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay3_reg      | Flip-flop |   2   |  Y  | N  | N  | Y  | N  | N  | N  |
|     delay2_reg      | Flip-flop |  17   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay2_reg      | Flip-flop |   2   |  Y  | N  | N  | Y  | N  | N  | N  |
|     delay1_reg      | Flip-flop |  17   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay1_reg      | Flip-flop |   2   |  Y  | N  | N  | Y  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'DELAY' instantiated from design 'ADAP_SPED_CTL' with
	the parameters "RESET_STATE=0,WIDTH=12". (HDL-193)

Inferred memory devices in process
	in routine DELAY_RESET_STATE0_WIDTH12 line 81 in file
		'/home/pi4810/eeee720/proj/mcac_bs/DELAY/src/DELAY.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     delay0_reg      | Flip-flop |  12   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay7_reg      | Flip-flop |  12   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay6_reg      | Flip-flop |  12   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay5_reg      | Flip-flop |  12   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay4_reg      | Flip-flop |  12   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay3_reg      | Flip-flop |  12   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay2_reg      | Flip-flop |  12   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay1_reg      | Flip-flop |  12   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'DELAY' instantiated from design 'ADAP_SPED_CTL' with
	the parameters "RESET_STATE=0,WIDTH=14". (HDL-193)

Inferred memory devices in process
	in routine DELAY_RESET_STATE0_WIDTH14 line 81 in file
		'/home/pi4810/eeee720/proj/mcac_bs/DELAY/src/DELAY.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     delay0_reg      | Flip-flop |  14   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay7_reg      | Flip-flop |  14   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay6_reg      | Flip-flop |  14   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay5_reg      | Flip-flop |  14   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay4_reg      | Flip-flop |  14   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay3_reg      | Flip-flop |  14   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay2_reg      | Flip-flop |  14   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay1_reg      | Flip-flop |  14   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'DELAY' instantiated from design 'ADAP_SPED_CTL' with
	the parameters "RESET_STATE=0,WIDTH=10". (HDL-193)

Inferred memory devices in process
	in routine DELAY_RESET_STATE0_WIDTH10 line 81 in file
		'/home/pi4810/eeee720/proj/mcac_bs/DELAY/src/DELAY.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     delay0_reg      | Flip-flop |  10   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay7_reg      | Flip-flop |  10   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay6_reg      | Flip-flop |  10   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay5_reg      | Flip-flop |  10   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay4_reg      | Flip-flop |  10   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay3_reg      | Flip-flop |  10   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay2_reg      | Flip-flop |  10   |  Y  | N  | Y  | N  | N  | N  | N  |
|     delay1_reg      | Flip-flop |  10   |  Y  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
Information: Building the design 'DELAY' instantiated from design 'TON_TRAN_DET' with
	the parameters "WIDTH=1". (HDL-193)

Inferred memory devices in process
	in routine DELAY_WIDTH1 line 81 in file
		'/home/pi4810/eeee720/proj/mcac_bs/DELAY/src/DELAY.v'.
===============================================================================
|    Register Name    |   Type    | Width | Bus | MB | AR | AS | SR | SS | ST |
===============================================================================
|     delay0_reg      | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|     delay7_reg      | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|     delay6_reg      | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|     delay5_reg      | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|     delay4_reg      | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|     delay3_reg      | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|     delay2_reg      | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
|     delay1_reg      | Flip-flop |   1   |  N  | N  | Y  | N  | N  | N  | N  |
===============================================================================
Presto compilation completed successfully.
1
dc_shell> Removing uniquified design 'IN_REG'.
Removing uniquified design 'EXPAND'.
Removing uniquified design 'SUBTA'.
Removing uniquified design 'I_ADAP_QUAN'.
Removing uniquified design 'ADAP_PRED_REC_SIG'.
Removing uniquified design 'QUAN_SCAL_FAC_ADAP'.
Removing uniquified design 'ADAP_SPED_CTL'.
Removing uniquified design 'TON_TRAN_DET'.
Removing uniquified design 'FMULT_ACCUM'.
Removing uniquified design 'ACCUM'.
Removing uniquified design 'ADDA'.
Removing uniquified design 'ADDB'.
Removing uniquified design 'ADDC'.
Removing uniquified design 'ANTILOG'.
Removing uniquified design 'CU'.
Removing uniquified design 'DELAYPREDIC'.
Removing uniquified design 'FILTA'.
Removing uniquified design 'FILTB'.
Removing uniquified design 'FILTC'.
Removing uniquified design 'FILTD'.
Removing uniquified design 'FILTE'.
Removing uniquified design 'FLOATA'.
Removing uniquified design 'FLOATB'.
Removing uniquified design 'FMULT'.
Removing uniquified design 'FUNCTF'.
Removing uniquified design 'FUNCTW'.
Removing uniquified design 'G711'.
Removing uniquified design 'LIMA'.
Removing uniquified design 'LIMB'.
Removing uniquified design 'LIMC'.
Removing uniquified design 'LIMD'.
Removing uniquified design 'LOG'.
Removing uniquified design 'MIX'.
Removing uniquified design 'RECONST'.
Removing uniquified design 'SUBTB'.
Removing uniquified design 'SUBTC'.
Removing uniquified design 'TONE'.
Removing uniquified design 'TRANS'.
Removing uniquified design 'TRIGA'.
Removing uniquified design 'TRIGB'.
Removing uniquified design 'UPA1'.
Removing uniquified design 'UPA2'.
Removing uniquified design 'UPB'.
Removing uniquified design 'XORA'.
Removing uniquified design 'CLOCK_GEN'.
Removing uniquified design 'RF'.
Removing uniquified design 'DELAY_RESET_STATE0_WIDTH1'.
Removing uniquified design 'DELAY_020_11'.
Removing uniquified design 'TRIGB_WIDTH16'.
Removing uniquified design 'DELAY_RESET_STATE0_WIDTH16'.
Removing uniquified design 'DELAY_0220_13'.
Removing uniquified design 'DELAY_08800_19'.
Removing uniquified design 'DELAY_RESET_STATE0_WIDTH12'.
Removing uniquified design 'DELAY_RESET_STATE0_WIDTH14'.
Removing uniquified design 'DELAY_RESET_STATE0_WIDTH10'.
Removing uniquified design 'DELAY_WIDTH1'.
  Uniquified 2 instances of design 'IN_REG'.
  Uniquified 2 instances of design 'EXPAND'.
  Uniquified 2 instances of design 'SUBTA'.
  Uniquified 2 instances of design 'I_ADAP_QUAN'.
  Uniquified 2 instances of design 'ADAP_PRED_REC_SIG'.
  Uniquified 2 instances of design 'QUAN_SCAL_FAC_ADAP'.
  Uniquified 2 instances of design 'ADAP_SPED_CTL'.
  Uniquified 2 instances of design 'TON_TRAN_DET'.
  Uniquified 2 instances of design 'FMULT_ACCUM'.
  Uniquified 2 instances of design 'ACCUM'.
  Uniquified 2 instances of design 'ADDA'.
  Uniquified 2 instances of design 'ADDB'.
  Uniquified 2 instances of design 'ADDC'.
  Uniquified 2 instances of design 'ANTILOG'.
  Uniquified 2 instances of design 'CU'.
  Uniquified 12 instances of design 'DELAYPREDIC'.
  Uniquified 2 instances of design 'FILTA'.
  Uniquified 2 instances of design 'FILTB'.
  Uniquified 2 instances of design 'FILTC'.
  Uniquified 2 instances of design 'FILTD'.
  Uniquified 2 instances of design 'FILTE'.
  Uniquified 2 instances of design 'FLOATA'.
  Uniquified 2 instances of design 'FLOATB'.
  Uniquified 2 instances of design 'FMULT'.
  Uniquified 2 instances of design 'FUNCTF'.
  Uniquified 2 instances of design 'FUNCTW'.
  Uniquified 2 instances of design 'G711'.
  Uniquified 2 instances of design 'LIMA'.
  Uniquified 2 instances of design 'LIMB'.
  Uniquified 2 instances of design 'LIMC'.
  Uniquified 2 instances of design 'LIMD'.
  Uniquified 2 instances of design 'LOG'.
  Uniquified 2 instances of design 'MIX'.
  Uniquified 2 instances of design 'RECONST'.
  Uniquified 2 instances of design 'SUBTB'.
  Uniquified 2 instances of design 'SUBTC'.
  Uniquified 2 instances of design 'TONE'.
  Uniquified 2 instances of design 'TRANS'.
  Uniquified 2 instances of design 'TRIGA'.
  Uniquified 2 instances of design 'TRIGB'.
  Uniquified 2 instances of design 'UPA1'.
  Uniquified 2 instances of design 'UPA2'.
  Uniquified 12 instances of design 'UPB'.
  Uniquified 12 instances of design 'XORA'.
  Uniquified 2 instances of design 'CLOCK_GEN'.
  Uniquified 2 instances of design 'RF'.
  Uniquified 4 instances of design 'DELAY_RESET_STATE0_WIDTH1'.
  Uniquified 16 instances of design 'DELAY_020_11'.
  Uniquified 16 instances of design 'TRIGB_WIDTH16'.
  Uniquified 16 instances of design 'DELAY_RESET_STATE0_WIDTH16'.
  Uniquified 2 instances of design 'DELAY_0220_13'.
  Uniquified 2 instances of design 'DELAY_08800_19'.
  Uniquified 2 instances of design 'DELAY_RESET_STATE0_WIDTH12'.
  Uniquified 2 instances of design 'DELAY_RESET_STATE0_WIDTH14'.
  Uniquified 2 instances of design 'DELAY_RESET_STATE0_WIDTH10'.
  Uniquified 2 instances of design 'DELAY_WIDTH1'.
1
Information: Defining new variable 'OUTPUT_DELAY'. (CMD-041)
Information: Defining new variable 'CLK_PERIOD'. (CMD-041)
Information: Defining new variable 'CLK_SKEW'. (CMD-041)
Information: Defining new variable 'INPUT_DELAY'. (CMD-041)
Information: Defining new variable 'LOAD_MULT'. (CMD-041)
Information: Defining new variable 'RCC_MULT'. (CMD-041)
dc_shell> 10
dc_shell> Current design is 'mcac'.
Current design is 'mcac'.
Current design is 'mcac'.
>>> Searching for clock buffers
>>>   Clock Buffer Output Pin: mcac_enc/ienc_CU/delay_buf/Y out
>>>   Clock Buffer Output Pin: mcac_enc/ienc_CU/RF_buf1/Y out
>>>   Clock Buffer Output Pin: mcac_enc/ienc_CU/RF_buf2/Y out
>>>   Clock Buffer Output Pin: mcac_enc/iclock_gen/f_sync_in_buf/Y out
>>>   Clock Buffer Output Pin: mcac_enc/iclock_gen/f_sync_out_buf/Y out
>>>   Clock Buffer Output Pin: mcac_enc/iclock_gen/not_ch_clk_buf/Y out
>>>   Clock Buffer Output Pin: mcac_enc/iclock_gen/ch_clk_out_buf/Y out
>>>   Clock Buffer Output Pin: mcac_enc/iclock_gen/main_clk_buf/Y out
>>>   Clock Buffer Output Pin: mcac_dec/idec_CU/delay_buf/Y out
>>>   Clock Buffer Output Pin: mcac_dec/idec_CU/RF_buf1/Y out
>>>   Clock Buffer Output Pin: mcac_dec/idec_CU/RF_buf2/Y out
>>>   Clock Buffer Output Pin: mcac_dec/dec_clock_gen/f_sync_in_buf/Y out
>>>   Clock Buffer Output Pin: mcac_dec/dec_clock_gen/f_sync_out_buf/Y out
>>>   Clock Buffer Output Pin: mcac_dec/dec_clock_gen/not_ch_clk_buf/Y out
>>>   Clock Buffer Output Pin: mcac_dec/dec_clock_gen/ch_clk_out_buf/Y out
>>>   Clock Buffer Output Pin: mcac_dec/dec_clock_gen/main_clk_buf/Y out
>>> Done with clock buffers
Current design is 'mcac'.
Information: Defining new variable 'hfo_pin'. (CMD-041)
Information: Defining new variable 'clk_buffers'. (CMD-041)
Information: Defining new variable 'this_pin'. (CMD-041)
Information: Defining new variable 'hfo_pins'. (CMD-041)
Information: Defining new variable 'clk_buffer'. (CMD-041)
Information: Defining new variable 'this_cell'. (CMD-041)
{mcac}
dc_shell> Current design is 'mcac'.
Current design is 'dec'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'dec'. (UID-95)
Warning: ignore net test_mode because -no_propagate is not specified !
Current design is 'RF_0'.
Warning: Can't find net 'clk' in design 'RF_0'. (UID-95)
Warning: Can't find port 'clk' in design 'RF_0'. (UID-95)
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'RF_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'RF_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'RF_0'. (UID-95)
Current design is 'CLOCK_GEN_0'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'CLOCK_GEN_0'. (UID-95)
Warning: ignore net test_mode because -no_propagate is not specified !
Current design is 'CU_0'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'CU_0'. (UID-95)
Warning: ignore net test_mode because -no_propagate is not specified !
Current design is 'OUT_PCM'.
Warning: Can't find net 'clk' in design 'OUT_PCM'. (UID-95)
Warning: Can't find net 'reset' in design 'OUT_PCM'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'OUT_PCM'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'OUT_PCM'. (UID-95)
Warning: Can't find net 'test_mode' in design 'OUT_PCM'. (UID-95)
Warning: Can't find port 'test_mode' in design 'OUT_PCM'. (UID-95)
Current design is 'SYNC'.
Warning: Can't find net 'clk' in design 'SYNC'. (UID-95)
Warning: Can't find port 'clk' in design 'SYNC'. (UID-95)
Warning: Can't find net 'reset' in design 'SYNC'. (UID-95)
Warning: Can't find port 'reset' in design 'SYNC'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'SYNC'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'SYNC'. (UID-95)
Warning: Can't find net 'test_mode' in design 'SYNC'. (UID-95)
Warning: Can't find port 'test_mode' in design 'SYNC'. (UID-95)
Current design is 'SUBTB_0'.
Warning: Can't find net 'clk' in design 'SUBTB_0'. (UID-95)
Warning: Can't find port 'clk' in design 'SUBTB_0'. (UID-95)
Warning: Can't find net 'reset' in design 'SUBTB_0'. (UID-95)
Warning: Can't find port 'reset' in design 'SUBTB_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'SUBTB_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'SUBTB_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'SUBTB_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'SUBTB_0'. (UID-95)
Current design is 'LOG_0'.
Warning: Can't find net 'clk' in design 'LOG_0'. (UID-95)
Warning: Can't find port 'clk' in design 'LOG_0'. (UID-95)
Warning: Can't find net 'reset' in design 'LOG_0'. (UID-95)
Warning: Can't find port 'reset' in design 'LOG_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'LOG_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'LOG_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'LOG_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'LOG_0'. (UID-95)
Current design is 'SUBTA_0'.
Warning: Can't find net 'clk' in design 'SUBTA_0'. (UID-95)
Warning: Can't find port 'clk' in design 'SUBTA_0'. (UID-95)
Warning: Can't find net 'reset' in design 'SUBTA_0'. (UID-95)
Warning: Can't find port 'reset' in design 'SUBTA_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'SUBTA_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'SUBTA_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'SUBTA_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'SUBTA_0'. (UID-95)
Current design is 'EXPAND_0'.
Warning: Can't find net 'clk' in design 'EXPAND_0'. (UID-95)
Warning: Can't find port 'clk' in design 'EXPAND_0'. (UID-95)
Warning: Can't find net 'reset' in design 'EXPAND_0'. (UID-95)
Warning: Can't find port 'reset' in design 'EXPAND_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'EXPAND_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'EXPAND_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'EXPAND_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'EXPAND_0'. (UID-95)
Current design is 'G711_0'.
Warning: Can't find net 'clk' in design 'G711_0'. (UID-95)
Warning: Can't find port 'clk' in design 'G711_0'. (UID-95)
Warning: Can't find net 'reset' in design 'G711_0'. (UID-95)
Warning: Can't find port 'reset' in design 'G711_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'G711_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'G711_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'G711_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'G711_0'. (UID-95)
Current design is 'COMPRESS'.
Warning: Can't find net 'clk' in design 'COMPRESS'. (UID-95)
Warning: Can't find port 'clk' in design 'COMPRESS'. (UID-95)
Warning: Can't find net 'reset' in design 'COMPRESS'. (UID-95)
Warning: Can't find port 'reset' in design 'COMPRESS'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'COMPRESS'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'COMPRESS'. (UID-95)
Warning: Can't find net 'test_mode' in design 'COMPRESS'. (UID-95)
Warning: Can't find port 'test_mode' in design 'COMPRESS'. (UID-95)
Current design is 'IG711'.
Warning: Can't find net 'clk' in design 'IG711'. (UID-95)
Warning: Can't find port 'clk' in design 'IG711'. (UID-95)
Warning: Can't find net 'reset' in design 'IG711'. (UID-95)
Warning: Can't find port 'reset' in design 'IG711'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'IG711'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'IG711'. (UID-95)
Warning: Can't find net 'test_mode' in design 'IG711'. (UID-95)
Warning: Can't find port 'test_mode' in design 'IG711'. (UID-95)
Current design is 'QUAN_SCAL_FAC_ADAP_0'.
Warning: Can't find net 'clk' in design 'QUAN_SCAL_FAC_ADAP_0'. (UID-95)
Warning: Can't find port 'clk' in design 'QUAN_SCAL_FAC_ADAP_0'. (UID-95)
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'QUAN_SCAL_FAC_ADAP_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'QUAN_SCAL_FAC_ADAP_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'QUAN_SCAL_FAC_ADAP_0'. (UID-95)
Current design is 'MIX_0'.
Warning: Can't find net 'clk' in design 'MIX_0'. (UID-95)
Warning: Can't find port 'clk' in design 'MIX_0'. (UID-95)
Warning: Can't find net 'reset' in design 'MIX_0'. (UID-95)
Warning: Can't find port 'reset' in design 'MIX_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'MIX_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'MIX_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'MIX_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'MIX_0'. (UID-95)
Current design is 'DELAY_08800_19_0'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_08800_19_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_08800_19_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_08800_19_0'. (UID-95)
Current design is 'FILTE_0'.
Warning: Can't find net 'clk' in design 'FILTE_0'. (UID-95)
Warning: Can't find port 'clk' in design 'FILTE_0'. (UID-95)
Warning: Can't find net 'reset' in design 'FILTE_0'. (UID-95)
Warning: Can't find port 'reset' in design 'FILTE_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'FILTE_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'FILTE_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'FILTE_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'FILTE_0'. (UID-95)
Current design is 'DELAY_0220_13_0'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_0220_13_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_0220_13_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_0220_13_0'. (UID-95)
Current design is 'LIMB_0'.
Warning: Can't find net 'clk' in design 'LIMB_0'. (UID-95)
Warning: Can't find port 'clk' in design 'LIMB_0'. (UID-95)
Warning: Can't find net 'reset' in design 'LIMB_0'. (UID-95)
Warning: Can't find port 'reset' in design 'LIMB_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'LIMB_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'LIMB_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'LIMB_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'LIMB_0'. (UID-95)
Current design is 'FILTD_0'.
Warning: Can't find net 'clk' in design 'FILTD_0'. (UID-95)
Warning: Can't find port 'clk' in design 'FILTD_0'. (UID-95)
Warning: Can't find net 'reset' in design 'FILTD_0'. (UID-95)
Warning: Can't find port 'reset' in design 'FILTD_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'FILTD_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'FILTD_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'FILTD_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'FILTD_0'. (UID-95)
Current design is 'FUNCTW_0'.
Warning: Can't find net 'clk' in design 'FUNCTW_0'. (UID-95)
Warning: Can't find port 'clk' in design 'FUNCTW_0'. (UID-95)
Warning: Can't find net 'reset' in design 'FUNCTW_0'. (UID-95)
Warning: Can't find port 'reset' in design 'FUNCTW_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'FUNCTW_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'FUNCTW_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'FUNCTW_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'FUNCTW_0'. (UID-95)
Current design is 'ADAP_SPED_CTL_0'.
Warning: Can't find net 'clk' in design 'ADAP_SPED_CTL_0'. (UID-95)
Warning: Can't find port 'clk' in design 'ADAP_SPED_CTL_0'. (UID-95)
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'ADAP_SPED_CTL_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'ADAP_SPED_CTL_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'ADAP_SPED_CTL_0'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH10_0'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH10_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH10_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH10_0'. (UID-95)
Current design is 'LIMA_0'.
Warning: Can't find net 'clk' in design 'LIMA_0'. (UID-95)
Warning: Can't find port 'clk' in design 'LIMA_0'. (UID-95)
Warning: Can't find net 'reset' in design 'LIMA_0'. (UID-95)
Warning: Can't find port 'reset' in design 'LIMA_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'LIMA_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'LIMA_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'LIMA_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'LIMA_0'. (UID-95)
Current design is 'TRIGA_0'.
Warning: Can't find net 'clk' in design 'TRIGA_0'. (UID-95)
Warning: Can't find port 'clk' in design 'TRIGA_0'. (UID-95)
Warning: Can't find net 'reset' in design 'TRIGA_0'. (UID-95)
Warning: Can't find port 'reset' in design 'TRIGA_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TRIGA_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TRIGA_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TRIGA_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TRIGA_0'. (UID-95)
Current design is 'FILTC_0'.
Warning: Can't find net 'clk' in design 'FILTC_0'. (UID-95)
Warning: Can't find port 'clk' in design 'FILTC_0'. (UID-95)
Warning: Can't find net 'reset' in design 'FILTC_0'. (UID-95)
Warning: Can't find port 'reset' in design 'FILTC_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'FILTC_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'FILTC_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'FILTC_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'FILTC_0'. (UID-95)
Current design is 'SUBTC_0'.
Warning: Can't find net 'clk' in design 'SUBTC_0'. (UID-95)
Warning: Can't find port 'clk' in design 'SUBTC_0'. (UID-95)
Warning: Can't find net 'reset' in design 'SUBTC_0'. (UID-95)
Warning: Can't find port 'reset' in design 'SUBTC_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'SUBTC_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'SUBTC_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'SUBTC_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'SUBTC_0'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH14_0'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH14_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH14_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH14_0'. (UID-95)
Current design is 'FILTB_0'.
Warning: Can't find net 'clk' in design 'FILTB_0'. (UID-95)
Warning: Can't find port 'clk' in design 'FILTB_0'. (UID-95)
Warning: Can't find net 'reset' in design 'FILTB_0'. (UID-95)
Warning: Can't find port 'reset' in design 'FILTB_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'FILTB_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'FILTB_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'FILTB_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'FILTB_0'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH12_0'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH12_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH12_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH12_0'. (UID-95)
Current design is 'FILTA_0'.
Warning: Can't find net 'clk' in design 'FILTA_0'. (UID-95)
Warning: Can't find port 'clk' in design 'FILTA_0'. (UID-95)
Warning: Can't find net 'reset' in design 'FILTA_0'. (UID-95)
Warning: Can't find port 'reset' in design 'FILTA_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'FILTA_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'FILTA_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'FILTA_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'FILTA_0'. (UID-95)
Current design is 'FUNCTF_0'.
Warning: Can't find net 'clk' in design 'FUNCTF_0'. (UID-95)
Warning: Can't find port 'clk' in design 'FUNCTF_0'. (UID-95)
Warning: Can't find net 'reset' in design 'FUNCTF_0'. (UID-95)
Warning: Can't find port 'reset' in design 'FUNCTF_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'FUNCTF_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'FUNCTF_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'FUNCTF_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'FUNCTF_0'. (UID-95)
Current design is 'TON_TRAN_DET_0'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'TON_TRAN_DET_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TON_TRAN_DET_0'. (UID-95)
Current design is 'TRANS_0'.
Warning: Can't find net 'clk' in design 'TRANS_0'. (UID-95)
Warning: Can't find port 'clk' in design 'TRANS_0'. (UID-95)
Warning: Can't find net 'reset' in design 'TRANS_0'. (UID-95)
Warning: Can't find port 'reset' in design 'TRANS_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TRANS_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TRANS_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TRANS_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TRANS_0'. (UID-95)
Current design is 'DELAY_WIDTH1_0'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_WIDTH1_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_WIDTH1_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_WIDTH1_0'. (UID-95)
Current design is 'TRIGB_0'.
Warning: Can't find net 'clk' in design 'TRIGB_0'. (UID-95)
Warning: Can't find port 'clk' in design 'TRIGB_0'. (UID-95)
Warning: Can't find net 'reset' in design 'TRIGB_0'. (UID-95)
Warning: Can't find port 'reset' in design 'TRIGB_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TRIGB_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TRIGB_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TRIGB_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TRIGB_0'. (UID-95)
Current design is 'TONE_0'.
Warning: Can't find net 'clk' in design 'TONE_0'. (UID-95)
Warning: Can't find port 'clk' in design 'TONE_0'. (UID-95)
Warning: Can't find net 'reset' in design 'TONE_0'. (UID-95)
Warning: Can't find port 'reset' in design 'TONE_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TONE_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TONE_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TONE_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TONE_0'. (UID-95)
Current design is 'ADAP_PRED_REC_SIG_0'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'ADAP_PRED_REC_SIG_0'. (UID-95)
Warning: ignore net test_mode because -no_propagate is not specified !
Current design is 'FMULT_ACCUM_0'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'FMULT_ACCUM_0'. (UID-95)
Warning: ignore net test_mode because -no_propagate is not specified !
Current design is 'ACCUM_0'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'ACCUM_0'. (UID-95)
Warning: ignore net test_mode because -no_propagate is not specified !
Current design is 'FMULT_0'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'FMULT_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'FMULT_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'FMULT_0'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH16_12'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH16_12'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_12'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_12'. (UID-95)
Current design is 'TRIGB_WIDTH16_12'.
Warning: Can't find net 'clk' in design 'TRIGB_WIDTH16_12'. (UID-95)
Warning: Can't find port 'clk' in design 'TRIGB_WIDTH16_12'. (UID-95)
Warning: Can't find net 'reset' in design 'TRIGB_WIDTH16_12'. (UID-95)
Warning: Can't find port 'reset' in design 'TRIGB_WIDTH16_12'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TRIGB_WIDTH16_12'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TRIGB_WIDTH16_12'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TRIGB_WIDTH16_12'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TRIGB_WIDTH16_12'. (UID-95)
Current design is 'LIMD_0'.
Warning: Can't find net 'clk' in design 'LIMD_0'. (UID-95)
Warning: Can't find port 'clk' in design 'LIMD_0'. (UID-95)
Warning: Can't find net 'reset' in design 'LIMD_0'. (UID-95)
Warning: Can't find port 'reset' in design 'LIMD_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'LIMD_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'LIMD_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'LIMD_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'LIMD_0'. (UID-95)
Current design is 'UPA1_0'.
Warning: Can't find net 'clk' in design 'UPA1_0'. (UID-95)
Warning: Can't find port 'clk' in design 'UPA1_0'. (UID-95)
Warning: Can't find net 'reset' in design 'UPA1_0'. (UID-95)
Warning: Can't find port 'reset' in design 'UPA1_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'UPA1_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'UPA1_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'UPA1_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'UPA1_0'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH16_13'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH16_13'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_13'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_13'. (UID-95)
Current design is 'TRIGB_WIDTH16_13'.
Warning: Can't find net 'clk' in design 'TRIGB_WIDTH16_13'. (UID-95)
Warning: Can't find port 'clk' in design 'TRIGB_WIDTH16_13'. (UID-95)
Warning: Can't find net 'reset' in design 'TRIGB_WIDTH16_13'. (UID-95)
Warning: Can't find port 'reset' in design 'TRIGB_WIDTH16_13'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TRIGB_WIDTH16_13'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TRIGB_WIDTH16_13'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TRIGB_WIDTH16_13'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TRIGB_WIDTH16_13'. (UID-95)
Current design is 'LIMC_0'.
Warning: Can't find net 'clk' in design 'LIMC_0'. (UID-95)
Warning: Can't find port 'clk' in design 'LIMC_0'. (UID-95)
Warning: Can't find net 'reset' in design 'LIMC_0'. (UID-95)
Warning: Can't find port 'reset' in design 'LIMC_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'LIMC_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'LIMC_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'LIMC_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'LIMC_0'. (UID-95)
Current design is 'UPA2_0'.
Warning: Can't find net 'clk' in design 'UPA2_0'. (UID-95)
Warning: Can't find port 'clk' in design 'UPA2_0'. (UID-95)
Warning: Can't find net 'reset' in design 'UPA2_0'. (UID-95)
Warning: Can't find port 'reset' in design 'UPA2_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'UPA2_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'UPA2_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'UPA2_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'UPA2_0'. (UID-95)
Current design is 'DELAY_020_11_12'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_020_11_12'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_020_11_12'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_020_11_12'. (UID-95)
Current design is 'DELAYPREDIC_0'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAYPREDIC_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAYPREDIC_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAYPREDIC_0'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH16_0'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH16_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_0'. (UID-95)
Current design is 'TRIGB_WIDTH16_0'.
Warning: Can't find net 'clk' in design 'TRIGB_WIDTH16_0'. (UID-95)
Warning: Can't find port 'clk' in design 'TRIGB_WIDTH16_0'. (UID-95)
Warning: Can't find net 'reset' in design 'TRIGB_WIDTH16_0'. (UID-95)
Warning: Can't find port 'reset' in design 'TRIGB_WIDTH16_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TRIGB_WIDTH16_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TRIGB_WIDTH16_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TRIGB_WIDTH16_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TRIGB_WIDTH16_0'. (UID-95)
Current design is 'UPB_0'.
Warning: Can't find net 'clk' in design 'UPB_0'. (UID-95)
Warning: Can't find port 'clk' in design 'UPB_0'. (UID-95)
Warning: Can't find net 'reset' in design 'UPB_0'. (UID-95)
Warning: Can't find port 'reset' in design 'UPB_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'UPB_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'UPB_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'UPB_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'UPB_0'. (UID-95)
Current design is 'XORA_0'.
Warning: Can't find net 'clk' in design 'XORA_0'. (UID-95)
Warning: Can't find port 'clk' in design 'XORA_0'. (UID-95)
Warning: Can't find net 'reset' in design 'XORA_0'. (UID-95)
Warning: Can't find port 'reset' in design 'XORA_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'XORA_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'XORA_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'XORA_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'XORA_0'. (UID-95)
Current design is 'DELAY_020_11_0'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_020_11_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_020_11_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_020_11_0'. (UID-95)
Current design is 'DELAYPREDIC_1'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAYPREDIC_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAYPREDIC_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAYPREDIC_1'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH16_1'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH16_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_1'. (UID-95)
Current design is 'TRIGB_WIDTH16_1'.
Warning: Can't find net 'clk' in design 'TRIGB_WIDTH16_1'. (UID-95)
Warning: Can't find port 'clk' in design 'TRIGB_WIDTH16_1'. (UID-95)
Warning: Can't find net 'reset' in design 'TRIGB_WIDTH16_1'. (UID-95)
Warning: Can't find port 'reset' in design 'TRIGB_WIDTH16_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TRIGB_WIDTH16_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TRIGB_WIDTH16_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TRIGB_WIDTH16_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TRIGB_WIDTH16_1'. (UID-95)
Current design is 'UPB_1'.
Warning: Can't find net 'clk' in design 'UPB_1'. (UID-95)
Warning: Can't find port 'clk' in design 'UPB_1'. (UID-95)
Warning: Can't find net 'reset' in design 'UPB_1'. (UID-95)
Warning: Can't find port 'reset' in design 'UPB_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'UPB_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'UPB_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'UPB_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'UPB_1'. (UID-95)
Current design is 'XORA_1'.
Warning: Can't find net 'clk' in design 'XORA_1'. (UID-95)
Warning: Can't find port 'clk' in design 'XORA_1'. (UID-95)
Warning: Can't find net 'reset' in design 'XORA_1'. (UID-95)
Warning: Can't find port 'reset' in design 'XORA_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'XORA_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'XORA_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'XORA_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'XORA_1'. (UID-95)
Current design is 'DELAY_020_11_1'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_020_11_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_020_11_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_020_11_1'. (UID-95)
Current design is 'DELAYPREDIC_2'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAYPREDIC_2'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAYPREDIC_2'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAYPREDIC_2'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH16_2'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH16_2'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_2'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_2'. (UID-95)
Current design is 'TRIGB_WIDTH16_2'.
Warning: Can't find net 'clk' in design 'TRIGB_WIDTH16_2'. (UID-95)
Warning: Can't find port 'clk' in design 'TRIGB_WIDTH16_2'. (UID-95)
Warning: Can't find net 'reset' in design 'TRIGB_WIDTH16_2'. (UID-95)
Warning: Can't find port 'reset' in design 'TRIGB_WIDTH16_2'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TRIGB_WIDTH16_2'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TRIGB_WIDTH16_2'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TRIGB_WIDTH16_2'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TRIGB_WIDTH16_2'. (UID-95)
Current design is 'UPB_2'.
Warning: Can't find net 'clk' in design 'UPB_2'. (UID-95)
Warning: Can't find port 'clk' in design 'UPB_2'. (UID-95)
Warning: Can't find net 'reset' in design 'UPB_2'. (UID-95)
Warning: Can't find port 'reset' in design 'UPB_2'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'UPB_2'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'UPB_2'. (UID-95)
Warning: Can't find net 'test_mode' in design 'UPB_2'. (UID-95)
Warning: Can't find port 'test_mode' in design 'UPB_2'. (UID-95)
Current design is 'XORA_2'.
Warning: Can't find net 'clk' in design 'XORA_2'. (UID-95)
Warning: Can't find port 'clk' in design 'XORA_2'. (UID-95)
Warning: Can't find net 'reset' in design 'XORA_2'. (UID-95)
Warning: Can't find port 'reset' in design 'XORA_2'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'XORA_2'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'XORA_2'. (UID-95)
Warning: Can't find net 'test_mode' in design 'XORA_2'. (UID-95)
Warning: Can't find port 'test_mode' in design 'XORA_2'. (UID-95)
Current design is 'DELAY_020_11_2'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_020_11_2'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_020_11_2'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_020_11_2'. (UID-95)
Current design is 'DELAYPREDIC_3'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAYPREDIC_3'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAYPREDIC_3'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAYPREDIC_3'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH16_3'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH16_3'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_3'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_3'. (UID-95)
Current design is 'TRIGB_WIDTH16_3'.
Warning: Can't find net 'clk' in design 'TRIGB_WIDTH16_3'. (UID-95)
Warning: Can't find port 'clk' in design 'TRIGB_WIDTH16_3'. (UID-95)
Warning: Can't find net 'reset' in design 'TRIGB_WIDTH16_3'. (UID-95)
Warning: Can't find port 'reset' in design 'TRIGB_WIDTH16_3'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TRIGB_WIDTH16_3'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TRIGB_WIDTH16_3'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TRIGB_WIDTH16_3'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TRIGB_WIDTH16_3'. (UID-95)
Current design is 'UPB_3'.
Warning: Can't find net 'clk' in design 'UPB_3'. (UID-95)
Warning: Can't find port 'clk' in design 'UPB_3'. (UID-95)
Warning: Can't find net 'reset' in design 'UPB_3'. (UID-95)
Warning: Can't find port 'reset' in design 'UPB_3'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'UPB_3'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'UPB_3'. (UID-95)
Warning: Can't find net 'test_mode' in design 'UPB_3'. (UID-95)
Warning: Can't find port 'test_mode' in design 'UPB_3'. (UID-95)
Current design is 'XORA_3'.
Warning: Can't find net 'clk' in design 'XORA_3'. (UID-95)
Warning: Can't find port 'clk' in design 'XORA_3'. (UID-95)
Warning: Can't find net 'reset' in design 'XORA_3'. (UID-95)
Warning: Can't find port 'reset' in design 'XORA_3'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'XORA_3'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'XORA_3'. (UID-95)
Warning: Can't find net 'test_mode' in design 'XORA_3'. (UID-95)
Warning: Can't find port 'test_mode' in design 'XORA_3'. (UID-95)
Current design is 'DELAY_020_11_3'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_020_11_3'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_020_11_3'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_020_11_3'. (UID-95)
Current design is 'DELAYPREDIC_4'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAYPREDIC_4'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAYPREDIC_4'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAYPREDIC_4'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH16_4'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH16_4'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_4'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_4'. (UID-95)
Current design is 'TRIGB_WIDTH16_4'.
Warning: Can't find net 'clk' in design 'TRIGB_WIDTH16_4'. (UID-95)
Warning: Can't find port 'clk' in design 'TRIGB_WIDTH16_4'. (UID-95)
Warning: Can't find net 'reset' in design 'TRIGB_WIDTH16_4'. (UID-95)
Warning: Can't find port 'reset' in design 'TRIGB_WIDTH16_4'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TRIGB_WIDTH16_4'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TRIGB_WIDTH16_4'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TRIGB_WIDTH16_4'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TRIGB_WIDTH16_4'. (UID-95)
Current design is 'UPB_4'.
Warning: Can't find net 'clk' in design 'UPB_4'. (UID-95)
Warning: Can't find port 'clk' in design 'UPB_4'. (UID-95)
Warning: Can't find net 'reset' in design 'UPB_4'. (UID-95)
Warning: Can't find port 'reset' in design 'UPB_4'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'UPB_4'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'UPB_4'. (UID-95)
Warning: Can't find net 'test_mode' in design 'UPB_4'. (UID-95)
Warning: Can't find port 'test_mode' in design 'UPB_4'. (UID-95)
Current design is 'XORA_4'.
Warning: Can't find net 'clk' in design 'XORA_4'. (UID-95)
Warning: Can't find port 'clk' in design 'XORA_4'. (UID-95)
Warning: Can't find net 'reset' in design 'XORA_4'. (UID-95)
Warning: Can't find port 'reset' in design 'XORA_4'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'XORA_4'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'XORA_4'. (UID-95)
Warning: Can't find net 'test_mode' in design 'XORA_4'. (UID-95)
Warning: Can't find port 'test_mode' in design 'XORA_4'. (UID-95)
Current design is 'DELAY_020_11_4'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_020_11_4'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_020_11_4'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_020_11_4'. (UID-95)
Current design is 'DELAYPREDIC_5'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAYPREDIC_5'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAYPREDIC_5'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAYPREDIC_5'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH16_5'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH16_5'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_5'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_5'. (UID-95)
Current design is 'TRIGB_WIDTH16_5'.
Warning: Can't find net 'clk' in design 'TRIGB_WIDTH16_5'. (UID-95)
Warning: Can't find port 'clk' in design 'TRIGB_WIDTH16_5'. (UID-95)
Warning: Can't find net 'reset' in design 'TRIGB_WIDTH16_5'. (UID-95)
Warning: Can't find port 'reset' in design 'TRIGB_WIDTH16_5'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TRIGB_WIDTH16_5'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TRIGB_WIDTH16_5'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TRIGB_WIDTH16_5'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TRIGB_WIDTH16_5'. (UID-95)
Current design is 'UPB_5'.
Warning: Can't find net 'clk' in design 'UPB_5'. (UID-95)
Warning: Can't find port 'clk' in design 'UPB_5'. (UID-95)
Warning: Can't find net 'reset' in design 'UPB_5'. (UID-95)
Warning: Can't find port 'reset' in design 'UPB_5'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'UPB_5'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'UPB_5'. (UID-95)
Warning: Can't find net 'test_mode' in design 'UPB_5'. (UID-95)
Warning: Can't find port 'test_mode' in design 'UPB_5'. (UID-95)
Current design is 'XORA_5'.
Warning: Can't find net 'clk' in design 'XORA_5'. (UID-95)
Warning: Can't find port 'clk' in design 'XORA_5'. (UID-95)
Warning: Can't find net 'reset' in design 'XORA_5'. (UID-95)
Warning: Can't find port 'reset' in design 'XORA_5'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'XORA_5'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'XORA_5'. (UID-95)
Warning: Can't find net 'test_mode' in design 'XORA_5'. (UID-95)
Warning: Can't find port 'test_mode' in design 'XORA_5'. (UID-95)
Current design is 'DELAY_020_11_5'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_020_11_5'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_020_11_5'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_020_11_5'. (UID-95)
Current design is 'FLOATA_0'.
Warning: Can't find net 'clk' in design 'FLOATA_0'. (UID-95)
Warning: Can't find port 'clk' in design 'FLOATA_0'. (UID-95)
Warning: Can't find net 'reset' in design 'FLOATA_0'. (UID-95)
Warning: Can't find port 'reset' in design 'FLOATA_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'FLOATA_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'FLOATA_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'FLOATA_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'FLOATA_0'. (UID-95)
Current design is 'DELAY_020_11_13'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_020_11_13'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_020_11_13'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_020_11_13'. (UID-95)
Current design is 'FLOATB_0'.
Warning: Can't find net 'clk' in design 'FLOATB_0'. (UID-95)
Warning: Can't find port 'clk' in design 'FLOATB_0'. (UID-95)
Warning: Can't find net 'reset' in design 'FLOATB_0'. (UID-95)
Warning: Can't find port 'reset' in design 'FLOATB_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'FLOATB_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'FLOATB_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'FLOATB_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'FLOATB_0'. (UID-95)
Current design is 'ADDB_0'.
Warning: Can't find net 'clk' in design 'ADDB_0'. (UID-95)
Warning: Can't find port 'clk' in design 'ADDB_0'. (UID-95)
Warning: Can't find net 'reset' in design 'ADDB_0'. (UID-95)
Warning: Can't find port 'reset' in design 'ADDB_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'ADDB_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'ADDB_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'ADDB_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'ADDB_0'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH1_0'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH1_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH1_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH1_0'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH1_1'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH1_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH1_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH1_1'. (UID-95)
Current design is 'ADDC_0'.
Warning: Can't find net 'clk' in design 'ADDC_0'. (UID-95)
Warning: Can't find port 'clk' in design 'ADDC_0'. (UID-95)
Warning: Can't find net 'reset' in design 'ADDC_0'. (UID-95)
Warning: Can't find port 'reset' in design 'ADDC_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'ADDC_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'ADDC_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'ADDC_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'ADDC_0'. (UID-95)
Current design is 'I_ADAP_QUAN_0'.
Warning: Can't find net 'clk' in design 'I_ADAP_QUAN_0'. (UID-95)
Warning: Can't find port 'clk' in design 'I_ADAP_QUAN_0'. (UID-95)
Warning: Can't find net 'reset' in design 'I_ADAP_QUAN_0'. (UID-95)
Warning: Can't find port 'reset' in design 'I_ADAP_QUAN_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'I_ADAP_QUAN_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'I_ADAP_QUAN_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'I_ADAP_QUAN_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'I_ADAP_QUAN_0'. (UID-95)
Current design is 'ANTILOG_0'.
Warning: Can't find net 'clk' in design 'ANTILOG_0'. (UID-95)
Warning: Can't find port 'clk' in design 'ANTILOG_0'. (UID-95)
Warning: Can't find net 'reset' in design 'ANTILOG_0'. (UID-95)
Warning: Can't find port 'reset' in design 'ANTILOG_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'ANTILOG_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'ANTILOG_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'ANTILOG_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'ANTILOG_0'. (UID-95)
Current design is 'ADDA_0'.
Warning: Can't find net 'clk' in design 'ADDA_0'. (UID-95)
Warning: Can't find port 'clk' in design 'ADDA_0'. (UID-95)
Warning: Can't find net 'reset' in design 'ADDA_0'. (UID-95)
Warning: Can't find port 'reset' in design 'ADDA_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'ADDA_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'ADDA_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'ADDA_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'ADDA_0'. (UID-95)
Current design is 'RECONST_0'.
Warning: Can't find net 'clk' in design 'RECONST_0'. (UID-95)
Warning: Can't find port 'clk' in design 'RECONST_0'. (UID-95)
Warning: Can't find net 'reset' in design 'RECONST_0'. (UID-95)
Warning: Can't find port 'reset' in design 'RECONST_0'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'RECONST_0'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'RECONST_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'RECONST_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'RECONST_0'. (UID-95)
Current design is 'IN_REG_0'.
Warning: Can't find net 'clk' in design 'IN_REG_0'. (UID-95)
Warning: Can't find port 'clk' in design 'IN_REG_0'. (UID-95)
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'IN_REG_0'. (UID-95)
Warning: Can't find net 'test_mode' in design 'IN_REG_0'. (UID-95)
Warning: Can't find port 'test_mode' in design 'IN_REG_0'. (UID-95)
Current design is 'enc'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'enc'. (UID-95)
Warning: ignore net test_mode because -no_propagate is not specified !
Current design is 'RF_1'.
Warning: Can't find net 'clk' in design 'RF_1'. (UID-95)
Warning: Can't find port 'clk' in design 'RF_1'. (UID-95)
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'RF_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'RF_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'RF_1'. (UID-95)
Current design is 'CLOCK_GEN_1'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'CLOCK_GEN_1'. (UID-95)
Warning: ignore net test_mode because -no_propagate is not specified !
Current design is 'CU_1'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'CU_1'. (UID-95)
Warning: ignore net test_mode because -no_propagate is not specified !
Current design is 'TON_TRAN_DET_1'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'TON_TRAN_DET_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TON_TRAN_DET_1'. (UID-95)
Current design is 'TRANS_1'.
Warning: Can't find net 'clk' in design 'TRANS_1'. (UID-95)
Warning: Can't find port 'clk' in design 'TRANS_1'. (UID-95)
Warning: Can't find net 'reset' in design 'TRANS_1'. (UID-95)
Warning: Can't find port 'reset' in design 'TRANS_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TRANS_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TRANS_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TRANS_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TRANS_1'. (UID-95)
Current design is 'DELAY_WIDTH1_1'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_WIDTH1_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_WIDTH1_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_WIDTH1_1'. (UID-95)
Current design is 'TRIGB_1'.
Warning: Can't find net 'clk' in design 'TRIGB_1'. (UID-95)
Warning: Can't find port 'clk' in design 'TRIGB_1'. (UID-95)
Warning: Can't find net 'reset' in design 'TRIGB_1'. (UID-95)
Warning: Can't find port 'reset' in design 'TRIGB_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TRIGB_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TRIGB_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TRIGB_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TRIGB_1'. (UID-95)
Current design is 'TONE_1'.
Warning: Can't find net 'clk' in design 'TONE_1'. (UID-95)
Warning: Can't find port 'clk' in design 'TONE_1'. (UID-95)
Warning: Can't find net 'reset' in design 'TONE_1'. (UID-95)
Warning: Can't find port 'reset' in design 'TONE_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TONE_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TONE_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TONE_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TONE_1'. (UID-95)
Current design is 'ADAP_SPED_CTL_1'.
Warning: Can't find net 'clk' in design 'ADAP_SPED_CTL_1'. (UID-95)
Warning: Can't find port 'clk' in design 'ADAP_SPED_CTL_1'. (UID-95)
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'ADAP_SPED_CTL_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'ADAP_SPED_CTL_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'ADAP_SPED_CTL_1'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH10_1'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH10_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH10_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH10_1'. (UID-95)
Current design is 'LIMA_1'.
Warning: Can't find net 'clk' in design 'LIMA_1'. (UID-95)
Warning: Can't find port 'clk' in design 'LIMA_1'. (UID-95)
Warning: Can't find net 'reset' in design 'LIMA_1'. (UID-95)
Warning: Can't find port 'reset' in design 'LIMA_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'LIMA_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'LIMA_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'LIMA_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'LIMA_1'. (UID-95)
Current design is 'TRIGA_1'.
Warning: Can't find net 'clk' in design 'TRIGA_1'. (UID-95)
Warning: Can't find port 'clk' in design 'TRIGA_1'. (UID-95)
Warning: Can't find net 'reset' in design 'TRIGA_1'. (UID-95)
Warning: Can't find port 'reset' in design 'TRIGA_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TRIGA_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TRIGA_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TRIGA_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TRIGA_1'. (UID-95)
Current design is 'FILTC_1'.
Warning: Can't find net 'clk' in design 'FILTC_1'. (UID-95)
Warning: Can't find port 'clk' in design 'FILTC_1'. (UID-95)
Warning: Can't find net 'reset' in design 'FILTC_1'. (UID-95)
Warning: Can't find port 'reset' in design 'FILTC_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'FILTC_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'FILTC_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'FILTC_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'FILTC_1'. (UID-95)
Current design is 'SUBTC_1'.
Warning: Can't find net 'clk' in design 'SUBTC_1'. (UID-95)
Warning: Can't find port 'clk' in design 'SUBTC_1'. (UID-95)
Warning: Can't find net 'reset' in design 'SUBTC_1'. (UID-95)
Warning: Can't find port 'reset' in design 'SUBTC_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'SUBTC_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'SUBTC_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'SUBTC_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'SUBTC_1'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH14_1'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH14_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH14_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH14_1'. (UID-95)
Current design is 'FILTB_1'.
Warning: Can't find net 'clk' in design 'FILTB_1'. (UID-95)
Warning: Can't find port 'clk' in design 'FILTB_1'. (UID-95)
Warning: Can't find net 'reset' in design 'FILTB_1'. (UID-95)
Warning: Can't find port 'reset' in design 'FILTB_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'FILTB_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'FILTB_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'FILTB_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'FILTB_1'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH12_1'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH12_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH12_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH12_1'. (UID-95)
Current design is 'FILTA_1'.
Warning: Can't find net 'clk' in design 'FILTA_1'. (UID-95)
Warning: Can't find port 'clk' in design 'FILTA_1'. (UID-95)
Warning: Can't find net 'reset' in design 'FILTA_1'. (UID-95)
Warning: Can't find port 'reset' in design 'FILTA_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'FILTA_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'FILTA_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'FILTA_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'FILTA_1'. (UID-95)
Current design is 'FUNCTF_1'.
Warning: Can't find net 'clk' in design 'FUNCTF_1'. (UID-95)
Warning: Can't find port 'clk' in design 'FUNCTF_1'. (UID-95)
Warning: Can't find net 'reset' in design 'FUNCTF_1'. (UID-95)
Warning: Can't find port 'reset' in design 'FUNCTF_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'FUNCTF_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'FUNCTF_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'FUNCTF_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'FUNCTF_1'. (UID-95)
Current design is 'QUAN_SCAL_FAC_ADAP_1'.
Warning: Can't find net 'clk' in design 'QUAN_SCAL_FAC_ADAP_1'. (UID-95)
Warning: Can't find port 'clk' in design 'QUAN_SCAL_FAC_ADAP_1'. (UID-95)
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'QUAN_SCAL_FAC_ADAP_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'QUAN_SCAL_FAC_ADAP_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'QUAN_SCAL_FAC_ADAP_1'. (UID-95)
Current design is 'MIX_1'.
Warning: Can't find net 'clk' in design 'MIX_1'. (UID-95)
Warning: Can't find port 'clk' in design 'MIX_1'. (UID-95)
Warning: Can't find net 'reset' in design 'MIX_1'. (UID-95)
Warning: Can't find port 'reset' in design 'MIX_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'MIX_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'MIX_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'MIX_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'MIX_1'. (UID-95)
Current design is 'DELAY_08800_19_1'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_08800_19_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_08800_19_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_08800_19_1'. (UID-95)
Current design is 'FILTE_1'.
Warning: Can't find net 'clk' in design 'FILTE_1'. (UID-95)
Warning: Can't find port 'clk' in design 'FILTE_1'. (UID-95)
Warning: Can't find net 'reset' in design 'FILTE_1'. (UID-95)
Warning: Can't find port 'reset' in design 'FILTE_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'FILTE_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'FILTE_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'FILTE_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'FILTE_1'. (UID-95)
Current design is 'DELAY_0220_13_1'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_0220_13_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_0220_13_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_0220_13_1'. (UID-95)
Current design is 'LIMB_1'.
Warning: Can't find net 'clk' in design 'LIMB_1'. (UID-95)
Warning: Can't find port 'clk' in design 'LIMB_1'. (UID-95)
Warning: Can't find net 'reset' in design 'LIMB_1'. (UID-95)
Warning: Can't find port 'reset' in design 'LIMB_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'LIMB_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'LIMB_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'LIMB_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'LIMB_1'. (UID-95)
Current design is 'FILTD_1'.
Warning: Can't find net 'clk' in design 'FILTD_1'. (UID-95)
Warning: Can't find port 'clk' in design 'FILTD_1'. (UID-95)
Warning: Can't find net 'reset' in design 'FILTD_1'. (UID-95)
Warning: Can't find port 'reset' in design 'FILTD_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'FILTD_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'FILTD_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'FILTD_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'FILTD_1'. (UID-95)
Current design is 'FUNCTW_1'.
Warning: Can't find net 'clk' in design 'FUNCTW_1'. (UID-95)
Warning: Can't find port 'clk' in design 'FUNCTW_1'. (UID-95)
Warning: Can't find net 'reset' in design 'FUNCTW_1'. (UID-95)
Warning: Can't find port 'reset' in design 'FUNCTW_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'FUNCTW_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'FUNCTW_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'FUNCTW_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'FUNCTW_1'. (UID-95)
Current design is 'ADAP_PRED_REC_SIG_1'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'ADAP_PRED_REC_SIG_1'. (UID-95)
Warning: ignore net test_mode because -no_propagate is not specified !
Current design is 'FMULT_ACCUM_1'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'FMULT_ACCUM_1'. (UID-95)
Warning: ignore net test_mode because -no_propagate is not specified !
Current design is 'ACCUM_1'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'ACCUM_1'. (UID-95)
Warning: ignore net test_mode because -no_propagate is not specified !
Current design is 'FMULT_1'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'FMULT_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'FMULT_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'FMULT_1'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH16_14'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH16_14'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_14'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_14'. (UID-95)
Current design is 'TRIGB_WIDTH16_14'.
Warning: Can't find net 'clk' in design 'TRIGB_WIDTH16_14'. (UID-95)
Warning: Can't find port 'clk' in design 'TRIGB_WIDTH16_14'. (UID-95)
Warning: Can't find net 'reset' in design 'TRIGB_WIDTH16_14'. (UID-95)
Warning: Can't find port 'reset' in design 'TRIGB_WIDTH16_14'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TRIGB_WIDTH16_14'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TRIGB_WIDTH16_14'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TRIGB_WIDTH16_14'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TRIGB_WIDTH16_14'. (UID-95)
Current design is 'LIMD_1'.
Warning: Can't find net 'clk' in design 'LIMD_1'. (UID-95)
Warning: Can't find port 'clk' in design 'LIMD_1'. (UID-95)
Warning: Can't find net 'reset' in design 'LIMD_1'. (UID-95)
Warning: Can't find port 'reset' in design 'LIMD_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'LIMD_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'LIMD_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'LIMD_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'LIMD_1'. (UID-95)
Current design is 'UPA1_1'.
Warning: Can't find net 'clk' in design 'UPA1_1'. (UID-95)
Warning: Can't find port 'clk' in design 'UPA1_1'. (UID-95)
Warning: Can't find net 'reset' in design 'UPA1_1'. (UID-95)
Warning: Can't find port 'reset' in design 'UPA1_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'UPA1_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'UPA1_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'UPA1_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'UPA1_1'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH16_15'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH16_15'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_15'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_15'. (UID-95)
Current design is 'TRIGB_WIDTH16_15'.
Warning: Can't find net 'clk' in design 'TRIGB_WIDTH16_15'. (UID-95)
Warning: Can't find port 'clk' in design 'TRIGB_WIDTH16_15'. (UID-95)
Warning: Can't find net 'reset' in design 'TRIGB_WIDTH16_15'. (UID-95)
Warning: Can't find port 'reset' in design 'TRIGB_WIDTH16_15'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TRIGB_WIDTH16_15'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TRIGB_WIDTH16_15'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TRIGB_WIDTH16_15'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TRIGB_WIDTH16_15'. (UID-95)
Current design is 'LIMC_1'.
Warning: Can't find net 'clk' in design 'LIMC_1'. (UID-95)
Warning: Can't find port 'clk' in design 'LIMC_1'. (UID-95)
Warning: Can't find net 'reset' in design 'LIMC_1'. (UID-95)
Warning: Can't find port 'reset' in design 'LIMC_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'LIMC_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'LIMC_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'LIMC_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'LIMC_1'. (UID-95)
Current design is 'UPA2_1'.
Warning: Can't find net 'clk' in design 'UPA2_1'. (UID-95)
Warning: Can't find port 'clk' in design 'UPA2_1'. (UID-95)
Warning: Can't find net 'reset' in design 'UPA2_1'. (UID-95)
Warning: Can't find port 'reset' in design 'UPA2_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'UPA2_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'UPA2_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'UPA2_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'UPA2_1'. (UID-95)
Current design is 'DELAY_020_11_14'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_020_11_14'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_020_11_14'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_020_11_14'. (UID-95)
Current design is 'DELAYPREDIC_6'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAYPREDIC_6'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAYPREDIC_6'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAYPREDIC_6'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH16_6'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH16_6'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_6'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_6'. (UID-95)
Current design is 'TRIGB_WIDTH16_6'.
Warning: Can't find net 'clk' in design 'TRIGB_WIDTH16_6'. (UID-95)
Warning: Can't find port 'clk' in design 'TRIGB_WIDTH16_6'. (UID-95)
Warning: Can't find net 'reset' in design 'TRIGB_WIDTH16_6'. (UID-95)
Warning: Can't find port 'reset' in design 'TRIGB_WIDTH16_6'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TRIGB_WIDTH16_6'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TRIGB_WIDTH16_6'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TRIGB_WIDTH16_6'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TRIGB_WIDTH16_6'. (UID-95)
Current design is 'UPB_6'.
Warning: Can't find net 'clk' in design 'UPB_6'. (UID-95)
Warning: Can't find port 'clk' in design 'UPB_6'. (UID-95)
Warning: Can't find net 'reset' in design 'UPB_6'. (UID-95)
Warning: Can't find port 'reset' in design 'UPB_6'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'UPB_6'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'UPB_6'. (UID-95)
Warning: Can't find net 'test_mode' in design 'UPB_6'. (UID-95)
Warning: Can't find port 'test_mode' in design 'UPB_6'. (UID-95)
Current design is 'XORA_6'.
Warning: Can't find net 'clk' in design 'XORA_6'. (UID-95)
Warning: Can't find port 'clk' in design 'XORA_6'. (UID-95)
Warning: Can't find net 'reset' in design 'XORA_6'. (UID-95)
Warning: Can't find port 'reset' in design 'XORA_6'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'XORA_6'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'XORA_6'. (UID-95)
Warning: Can't find net 'test_mode' in design 'XORA_6'. (UID-95)
Warning: Can't find port 'test_mode' in design 'XORA_6'. (UID-95)
Current design is 'DELAY_020_11_6'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_020_11_6'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_020_11_6'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_020_11_6'. (UID-95)
Current design is 'DELAYPREDIC_7'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAYPREDIC_7'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAYPREDIC_7'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAYPREDIC_7'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH16_7'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH16_7'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_7'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_7'. (UID-95)
Current design is 'TRIGB_WIDTH16_7'.
Warning: Can't find net 'clk' in design 'TRIGB_WIDTH16_7'. (UID-95)
Warning: Can't find port 'clk' in design 'TRIGB_WIDTH16_7'. (UID-95)
Warning: Can't find net 'reset' in design 'TRIGB_WIDTH16_7'. (UID-95)
Warning: Can't find port 'reset' in design 'TRIGB_WIDTH16_7'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TRIGB_WIDTH16_7'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TRIGB_WIDTH16_7'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TRIGB_WIDTH16_7'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TRIGB_WIDTH16_7'. (UID-95)
Current design is 'UPB_7'.
Warning: Can't find net 'clk' in design 'UPB_7'. (UID-95)
Warning: Can't find port 'clk' in design 'UPB_7'. (UID-95)
Warning: Can't find net 'reset' in design 'UPB_7'. (UID-95)
Warning: Can't find port 'reset' in design 'UPB_7'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'UPB_7'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'UPB_7'. (UID-95)
Warning: Can't find net 'test_mode' in design 'UPB_7'. (UID-95)
Warning: Can't find port 'test_mode' in design 'UPB_7'. (UID-95)
Current design is 'XORA_7'.
Warning: Can't find net 'clk' in design 'XORA_7'. (UID-95)
Warning: Can't find port 'clk' in design 'XORA_7'. (UID-95)
Warning: Can't find net 'reset' in design 'XORA_7'. (UID-95)
Warning: Can't find port 'reset' in design 'XORA_7'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'XORA_7'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'XORA_7'. (UID-95)
Warning: Can't find net 'test_mode' in design 'XORA_7'. (UID-95)
Warning: Can't find port 'test_mode' in design 'XORA_7'. (UID-95)
Current design is 'DELAY_020_11_7'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_020_11_7'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_020_11_7'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_020_11_7'. (UID-95)
Current design is 'DELAYPREDIC_8'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAYPREDIC_8'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAYPREDIC_8'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAYPREDIC_8'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH16_8'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH16_8'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_8'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_8'. (UID-95)
Current design is 'TRIGB_WIDTH16_8'.
Warning: Can't find net 'clk' in design 'TRIGB_WIDTH16_8'. (UID-95)
Warning: Can't find port 'clk' in design 'TRIGB_WIDTH16_8'. (UID-95)
Warning: Can't find net 'reset' in design 'TRIGB_WIDTH16_8'. (UID-95)
Warning: Can't find port 'reset' in design 'TRIGB_WIDTH16_8'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TRIGB_WIDTH16_8'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TRIGB_WIDTH16_8'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TRIGB_WIDTH16_8'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TRIGB_WIDTH16_8'. (UID-95)
Current design is 'UPB_8'.
Warning: Can't find net 'clk' in design 'UPB_8'. (UID-95)
Warning: Can't find port 'clk' in design 'UPB_8'. (UID-95)
Warning: Can't find net 'reset' in design 'UPB_8'. (UID-95)
Warning: Can't find port 'reset' in design 'UPB_8'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'UPB_8'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'UPB_8'. (UID-95)
Warning: Can't find net 'test_mode' in design 'UPB_8'. (UID-95)
Warning: Can't find port 'test_mode' in design 'UPB_8'. (UID-95)
Current design is 'XORA_8'.
Warning: Can't find net 'clk' in design 'XORA_8'. (UID-95)
Warning: Can't find port 'clk' in design 'XORA_8'. (UID-95)
Warning: Can't find net 'reset' in design 'XORA_8'. (UID-95)
Warning: Can't find port 'reset' in design 'XORA_8'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'XORA_8'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'XORA_8'. (UID-95)
Warning: Can't find net 'test_mode' in design 'XORA_8'. (UID-95)
Warning: Can't find port 'test_mode' in design 'XORA_8'. (UID-95)
Current design is 'DELAY_020_11_8'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_020_11_8'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_020_11_8'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_020_11_8'. (UID-95)
Current design is 'DELAYPREDIC_9'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAYPREDIC_9'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAYPREDIC_9'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAYPREDIC_9'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH16_9'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH16_9'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_9'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_9'. (UID-95)
Current design is 'TRIGB_WIDTH16_9'.
Warning: Can't find net 'clk' in design 'TRIGB_WIDTH16_9'. (UID-95)
Warning: Can't find port 'clk' in design 'TRIGB_WIDTH16_9'. (UID-95)
Warning: Can't find net 'reset' in design 'TRIGB_WIDTH16_9'. (UID-95)
Warning: Can't find port 'reset' in design 'TRIGB_WIDTH16_9'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TRIGB_WIDTH16_9'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TRIGB_WIDTH16_9'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TRIGB_WIDTH16_9'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TRIGB_WIDTH16_9'. (UID-95)
Current design is 'UPB_9'.
Warning: Can't find net 'clk' in design 'UPB_9'. (UID-95)
Warning: Can't find port 'clk' in design 'UPB_9'. (UID-95)
Warning: Can't find net 'reset' in design 'UPB_9'. (UID-95)
Warning: Can't find port 'reset' in design 'UPB_9'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'UPB_9'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'UPB_9'. (UID-95)
Warning: Can't find net 'test_mode' in design 'UPB_9'. (UID-95)
Warning: Can't find port 'test_mode' in design 'UPB_9'. (UID-95)
Current design is 'XORA_9'.
Warning: Can't find net 'clk' in design 'XORA_9'. (UID-95)
Warning: Can't find port 'clk' in design 'XORA_9'. (UID-95)
Warning: Can't find net 'reset' in design 'XORA_9'. (UID-95)
Warning: Can't find port 'reset' in design 'XORA_9'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'XORA_9'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'XORA_9'. (UID-95)
Warning: Can't find net 'test_mode' in design 'XORA_9'. (UID-95)
Warning: Can't find port 'test_mode' in design 'XORA_9'. (UID-95)
Current design is 'DELAY_020_11_9'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_020_11_9'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_020_11_9'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_020_11_9'. (UID-95)
Current design is 'DELAYPREDIC_10'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAYPREDIC_10'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAYPREDIC_10'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAYPREDIC_10'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH16_10'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH16_10'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_10'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_10'. (UID-95)
Current design is 'TRIGB_WIDTH16_10'.
Warning: Can't find net 'clk' in design 'TRIGB_WIDTH16_10'. (UID-95)
Warning: Can't find port 'clk' in design 'TRIGB_WIDTH16_10'. (UID-95)
Warning: Can't find net 'reset' in design 'TRIGB_WIDTH16_10'. (UID-95)
Warning: Can't find port 'reset' in design 'TRIGB_WIDTH16_10'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TRIGB_WIDTH16_10'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TRIGB_WIDTH16_10'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TRIGB_WIDTH16_10'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TRIGB_WIDTH16_10'. (UID-95)
Current design is 'UPB_10'.
Warning: Can't find net 'clk' in design 'UPB_10'. (UID-95)
Warning: Can't find port 'clk' in design 'UPB_10'. (UID-95)
Warning: Can't find net 'reset' in design 'UPB_10'. (UID-95)
Warning: Can't find port 'reset' in design 'UPB_10'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'UPB_10'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'UPB_10'. (UID-95)
Warning: Can't find net 'test_mode' in design 'UPB_10'. (UID-95)
Warning: Can't find port 'test_mode' in design 'UPB_10'. (UID-95)
Current design is 'XORA_10'.
Warning: Can't find net 'clk' in design 'XORA_10'. (UID-95)
Warning: Can't find port 'clk' in design 'XORA_10'. (UID-95)
Warning: Can't find net 'reset' in design 'XORA_10'. (UID-95)
Warning: Can't find port 'reset' in design 'XORA_10'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'XORA_10'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'XORA_10'. (UID-95)
Warning: Can't find net 'test_mode' in design 'XORA_10'. (UID-95)
Warning: Can't find port 'test_mode' in design 'XORA_10'. (UID-95)
Current design is 'DELAY_020_11_10'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_020_11_10'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_020_11_10'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_020_11_10'. (UID-95)
Current design is 'DELAYPREDIC_11'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAYPREDIC_11'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAYPREDIC_11'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAYPREDIC_11'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH16_11'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH16_11'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_11'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH16_11'. (UID-95)
Current design is 'TRIGB_WIDTH16_11'.
Warning: Can't find net 'clk' in design 'TRIGB_WIDTH16_11'. (UID-95)
Warning: Can't find port 'clk' in design 'TRIGB_WIDTH16_11'. (UID-95)
Warning: Can't find net 'reset' in design 'TRIGB_WIDTH16_11'. (UID-95)
Warning: Can't find port 'reset' in design 'TRIGB_WIDTH16_11'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'TRIGB_WIDTH16_11'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'TRIGB_WIDTH16_11'. (UID-95)
Warning: Can't find net 'test_mode' in design 'TRIGB_WIDTH16_11'. (UID-95)
Warning: Can't find port 'test_mode' in design 'TRIGB_WIDTH16_11'. (UID-95)
Current design is 'UPB_11'.
Warning: Can't find net 'clk' in design 'UPB_11'. (UID-95)
Warning: Can't find port 'clk' in design 'UPB_11'. (UID-95)
Warning: Can't find net 'reset' in design 'UPB_11'. (UID-95)
Warning: Can't find port 'reset' in design 'UPB_11'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'UPB_11'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'UPB_11'. (UID-95)
Warning: Can't find net 'test_mode' in design 'UPB_11'. (UID-95)
Warning: Can't find port 'test_mode' in design 'UPB_11'. (UID-95)
Current design is 'XORA_11'.
Warning: Can't find net 'clk' in design 'XORA_11'. (UID-95)
Warning: Can't find port 'clk' in design 'XORA_11'. (UID-95)
Warning: Can't find net 'reset' in design 'XORA_11'. (UID-95)
Warning: Can't find port 'reset' in design 'XORA_11'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'XORA_11'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'XORA_11'. (UID-95)
Warning: Can't find net 'test_mode' in design 'XORA_11'. (UID-95)
Warning: Can't find port 'test_mode' in design 'XORA_11'. (UID-95)
Current design is 'DELAY_020_11_11'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_020_11_11'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_020_11_11'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_020_11_11'. (UID-95)
Current design is 'FLOATA_1'.
Warning: Can't find net 'clk' in design 'FLOATA_1'. (UID-95)
Warning: Can't find port 'clk' in design 'FLOATA_1'. (UID-95)
Warning: Can't find net 'reset' in design 'FLOATA_1'. (UID-95)
Warning: Can't find port 'reset' in design 'FLOATA_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'FLOATA_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'FLOATA_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'FLOATA_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'FLOATA_1'. (UID-95)
Current design is 'DELAY_020_11_15'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_020_11_15'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_020_11_15'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_020_11_15'. (UID-95)
Current design is 'FLOATB_1'.
Warning: Can't find net 'clk' in design 'FLOATB_1'. (UID-95)
Warning: Can't find port 'clk' in design 'FLOATB_1'. (UID-95)
Warning: Can't find net 'reset' in design 'FLOATB_1'. (UID-95)
Warning: Can't find port 'reset' in design 'FLOATB_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'FLOATB_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'FLOATB_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'FLOATB_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'FLOATB_1'. (UID-95)
Current design is 'ADDB_1'.
Warning: Can't find net 'clk' in design 'ADDB_1'. (UID-95)
Warning: Can't find port 'clk' in design 'ADDB_1'. (UID-95)
Warning: Can't find net 'reset' in design 'ADDB_1'. (UID-95)
Warning: Can't find port 'reset' in design 'ADDB_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'ADDB_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'ADDB_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'ADDB_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'ADDB_1'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH1_2'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH1_2'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH1_2'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH1_2'. (UID-95)
Current design is 'DELAY_RESET_STATE0_WIDTH1_3'.
Warning: ignore net clk because -no_propagate is not specified !
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'DELAY_RESET_STATE0_WIDTH1_3'. (UID-95)
Warning: Can't find net 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH1_3'. (UID-95)
Warning: Can't find port 'test_mode' in design 'DELAY_RESET_STATE0_WIDTH1_3'. (UID-95)
Current design is 'ADDC_1'.
Warning: Can't find net 'clk' in design 'ADDC_1'. (UID-95)
Warning: Can't find port 'clk' in design 'ADDC_1'. (UID-95)
Warning: Can't find net 'reset' in design 'ADDC_1'. (UID-95)
Warning: Can't find port 'reset' in design 'ADDC_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'ADDC_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'ADDC_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'ADDC_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'ADDC_1'. (UID-95)
Current design is 'I_ADAP_QUAN_1'.
Warning: Can't find net 'clk' in design 'I_ADAP_QUAN_1'. (UID-95)
Warning: Can't find port 'clk' in design 'I_ADAP_QUAN_1'. (UID-95)
Warning: Can't find net 'reset' in design 'I_ADAP_QUAN_1'. (UID-95)
Warning: Can't find port 'reset' in design 'I_ADAP_QUAN_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'I_ADAP_QUAN_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'I_ADAP_QUAN_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'I_ADAP_QUAN_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'I_ADAP_QUAN_1'. (UID-95)
Current design is 'ANTILOG_1'.
Warning: Can't find net 'clk' in design 'ANTILOG_1'. (UID-95)
Warning: Can't find port 'clk' in design 'ANTILOG_1'. (UID-95)
Warning: Can't find net 'reset' in design 'ANTILOG_1'. (UID-95)
Warning: Can't find port 'reset' in design 'ANTILOG_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'ANTILOG_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'ANTILOG_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'ANTILOG_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'ANTILOG_1'. (UID-95)
Current design is 'ADDA_1'.
Warning: Can't find net 'clk' in design 'ADDA_1'. (UID-95)
Warning: Can't find port 'clk' in design 'ADDA_1'. (UID-95)
Warning: Can't find net 'reset' in design 'ADDA_1'. (UID-95)
Warning: Can't find port 'reset' in design 'ADDA_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'ADDA_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'ADDA_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'ADDA_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'ADDA_1'. (UID-95)
Current design is 'RECONST_1'.
Warning: Can't find net 'clk' in design 'RECONST_1'. (UID-95)
Warning: Can't find port 'clk' in design 'RECONST_1'. (UID-95)
Warning: Can't find net 'reset' in design 'RECONST_1'. (UID-95)
Warning: Can't find port 'reset' in design 'RECONST_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'RECONST_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'RECONST_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'RECONST_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'RECONST_1'. (UID-95)
Current design is 'ADAP_QUAN'.
Warning: Can't find net 'clk' in design 'ADAP_QUAN'. (UID-95)
Warning: Can't find port 'clk' in design 'ADAP_QUAN'. (UID-95)
Warning: Can't find net 'reset' in design 'ADAP_QUAN'. (UID-95)
Warning: Can't find port 'reset' in design 'ADAP_QUAN'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'ADAP_QUAN'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'ADAP_QUAN'. (UID-95)
Warning: Can't find net 'test_mode' in design 'ADAP_QUAN'. (UID-95)
Warning: Can't find port 'test_mode' in design 'ADAP_QUAN'. (UID-95)
Current design is 'QUAN'.
Warning: Can't find net 'clk' in design 'QUAN'. (UID-95)
Warning: Can't find port 'clk' in design 'QUAN'. (UID-95)
Warning: Can't find net 'reset' in design 'QUAN'. (UID-95)
Warning: Can't find port 'reset' in design 'QUAN'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'QUAN'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'QUAN'. (UID-95)
Warning: Can't find net 'test_mode' in design 'QUAN'. (UID-95)
Warning: Can't find port 'test_mode' in design 'QUAN'. (UID-95)
Current design is 'SUBTB_1'.
Warning: Can't find net 'clk' in design 'SUBTB_1'. (UID-95)
Warning: Can't find port 'clk' in design 'SUBTB_1'. (UID-95)
Warning: Can't find net 'reset' in design 'SUBTB_1'. (UID-95)
Warning: Can't find port 'reset' in design 'SUBTB_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'SUBTB_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'SUBTB_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'SUBTB_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'SUBTB_1'. (UID-95)
Current design is 'LOG_1'.
Warning: Can't find net 'clk' in design 'LOG_1'. (UID-95)
Warning: Can't find port 'clk' in design 'LOG_1'. (UID-95)
Warning: Can't find net 'reset' in design 'LOG_1'. (UID-95)
Warning: Can't find port 'reset' in design 'LOG_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'LOG_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'LOG_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'LOG_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'LOG_1'. (UID-95)
Current design is 'IN_PCM'.
Warning: Can't find net 'clk' in design 'IN_PCM'. (UID-95)
Warning: Can't find port 'clk' in design 'IN_PCM'. (UID-95)
Warning: Can't find net 'reset' in design 'IN_PCM'. (UID-95)
Warning: Can't find port 'reset' in design 'IN_PCM'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'IN_PCM'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'IN_PCM'. (UID-95)
Warning: Can't find net 'test_mode' in design 'IN_PCM'. (UID-95)
Warning: Can't find port 'test_mode' in design 'IN_PCM'. (UID-95)
Current design is 'SUBTA_1'.
Warning: Can't find net 'clk' in design 'SUBTA_1'. (UID-95)
Warning: Can't find port 'clk' in design 'SUBTA_1'. (UID-95)
Warning: Can't find net 'reset' in design 'SUBTA_1'. (UID-95)
Warning: Can't find port 'reset' in design 'SUBTA_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'SUBTA_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'SUBTA_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'SUBTA_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'SUBTA_1'. (UID-95)
Current design is 'EXPAND_1'.
Warning: Can't find net 'clk' in design 'EXPAND_1'. (UID-95)
Warning: Can't find port 'clk' in design 'EXPAND_1'. (UID-95)
Warning: Can't find net 'reset' in design 'EXPAND_1'. (UID-95)
Warning: Can't find port 'reset' in design 'EXPAND_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'EXPAND_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'EXPAND_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'EXPAND_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'EXPAND_1'. (UID-95)
Current design is 'G711_1'.
Warning: Can't find net 'clk' in design 'G711_1'. (UID-95)
Warning: Can't find port 'clk' in design 'G711_1'. (UID-95)
Warning: Can't find net 'reset' in design 'G711_1'. (UID-95)
Warning: Can't find port 'reset' in design 'G711_1'. (UID-95)
Warning: Can't find net 'scan_enable' in design 'G711_1'. (UID-95)
Warning: Can't find port 'scan_enable' in design 'G711_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'G711_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'G711_1'. (UID-95)
Current design is 'IN_REG_1'.
Warning: Can't find net 'clk' in design 'IN_REG_1'. (UID-95)
Warning: Can't find port 'clk' in design 'IN_REG_1'. (UID-95)
Warning: ignore net reset because -no_propagate is not specified !
Warning: Can't find net 'scan_enable' in design 'IN_REG_1'. (UID-95)
Warning: Can't find net 'test_mode' in design 'IN_REG_1'. (UID-95)
Warning: Can't find port 'test_mode' in design 'IN_REG_1'. (UID-95)
Current design is 'mcac'.
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Warning: Design rule attributes from the driving cell will be
	set on the port. (UID-401)
Current design is 'mcac'.
Information: Defining new variable 'my_load'. (CMD-041)
Information: Defining new variable 'hfo_nets'. (CMD-041)
Information: Defining new variable 'hfo_net'. (CMD-041)
Information: Defining new variable 'this_port'. (CMD-041)
{mcac}
dc_shell> 1
dc_shell> Current design is 'mcac'.
1
dc_shell> Current design is 'mcac'.
{mcac}
Information: Checking out the license 'DesignWare'. (SEC-104)
Information: Evaluating DesignWare library utilization. (UISN-27)
dc_shell> 
============================================================================
| DesignWare Building Block Library       |      Version       | Available |
============================================================================
| Basic DW Building Blocks                | D-2010.03-DWBB_1007
                                                               |     *     |
| Licensed DW Building Blocks             | D-2010.03-DWBB_1007
                                                               |     *     |
============================================================================


Information: There are 6059 potential problems in your design. Please run 'check_design' for more information. (LINT-99)



  Beginning Pass 1 Mapping
  ------------------------
  Processing 'RF_0'
  Processing 'CLOCK_GEN_0'
  Processing 'CU_0'
  Processing 'SYNC'
Information: Added key list 'DesignWare' to design 'SYNC'. (DDB-72)
  Processing 'SUBTB_0'
  Processing 'LOG_0'
  Processing 'SUBTA_0'
  Processing 'G711_0'
  Processing 'EXPAND_0'
  Processing 'IG711'
  Processing 'COMPRESS'
  Processing 'OUT_PCM'
  Processing 'MIX_0'
  Processing 'DELAY_08800_19_0'
  Processing 'FILTE_0'
  Processing 'DELAY_0220_13_0'
  Processing 'LIMB_0'
  Processing 'FILTD_0'
  Processing 'FUNCTW_0'
  Processing 'QUAN_SCAL_FAC_ADAP_0'
  Processing 'DELAY_RESET_STATE0_WIDTH10_0'
  Processing 'LIMA_0'
  Processing 'TRIGA_0'
  Processing 'FILTC_0'
  Processing 'SUBTC_0'
  Processing 'DELAY_RESET_STATE0_WIDTH14_0'
  Processing 'FILTB_0'
  Processing 'DELAY_RESET_STATE0_WIDTH12_0'
  Processing 'FILTA_0'
  Processing 'FUNCTF_0'
  Processing 'ADAP_SPED_CTL_0'
  Processing 'TRANS_0'
Information: Added key list 'DesignWare' to design 'TRANS_0'. (DDB-72)
  Processing 'DELAY_WIDTH1_0'
  Processing 'TRIGB_0'
  Processing 'TONE_0'
  Processing 'TON_TRAN_DET_0'
  Processing 'ACCUM_0'
  Processing 'FMULT_0'
Information: The register 'WAnMANT_rege_reg[0]' will be removed. (OPT-1207)
  Processing 'FMULT_ACCUM_0'
Information: Added key list 'DesignWare' to design 'FMULT_ACCUM_0'. (DDB-72)
  Processing 'DELAY_RESET_STATE0_WIDTH16_12'
  Processing 'TRIGB_WIDTH16_12'
  Processing 'LIMD_0'
  Processing 'UPA1_0'
  Processing 'LIMC_0'
  Processing 'UPA2_0'
  Processing 'DELAY_020_11_12'
  Processing 'UPB_0'
  Processing 'XORA_0'
  Processing 'DELAYPREDIC_0'
  Processing 'FLOATA_0'
  Processing 'FLOATB_0'
  Processing 'ADDB_0'
  Processing 'DELAY_RESET_STATE0_WIDTH1_0'
  Processing 'ADDC_0'
Information: Added key list 'DesignWare' to design 'ADDC_0'. (DDB-72)
  Processing 'ADAP_PRED_REC_SIG_0'
  Processing 'ANTILOG_0'
  Processing 'ADDA_0'
  Processing 'RECONST_0'
  Processing 'I_ADAP_QUAN_0'
  Processing 'IN_REG_0'
  Processing 'dec'
  Processing 'QUAN'
  Processing 'ADAP_QUAN'
  Processing 'IN_PCM'
  Processing 'enc'
  Processing 'mcac'

  Updating timing information
Information: Updating design information... (UID-85)
Warning: A non-unate path in clock network for clock 'clk'
 from pin 'mcac_dec/idec_CU/U57/Y' is detected. (TIM-052)

  Beginning Implementation Selection
  ----------------------------------
  Processing 'CLOCK_GEN_0_DW01_inc_0'
  Processing 'CU_0_DW01_inc_0'
  Mapping 'CU_0_DW_cmp_0'
  Processing 'CU_0_DW01_inc_1'
  Processing 'SYNC_DW01_inc_0'
  Processing 'SYNC_DW01_dec_0'
  Processing 'SYNC_DW01_dec_1'
  Processing 'SYNC_DW01_inc_1'
  Mapping 'SYNC_DW_cmp_0'
  Processing 'SYNC_DW01_add_0'
  Processing 'SYNC_DW01_add_1'
  Processing 'SYNC_DW01_add_2'
  Processing 'SYNC_DW01_add_3'
  Mapping 'SYNC_DW_cmp_1'
  Mapping 'SYNC_DW_cmp_2'
  Mapping 'SYNC_DW_cmp_3'
  Mapping 'SYNC_DW_cmp_4'
  Mapping 'SYNC_DW_cmp_5'
  Mapping 'SYNC_DW_cmp_6'
  Mapping 'SYNC_DW_cmp_7'
  Mapping 'SYNC_DW_cmp_8'
  Mapping 'SYNC_DW_cmp_9'
  Mapping 'SYNC_DW_cmp_10'
  Mapping 'SYNC_DW_cmp_11'
  Mapping 'SYNC_DW_cmp_12'
  Mapping 'SYNC_DW_cmp_13'
  Mapping 'SYNC_DW_cmp_14'
  Mapping 'SYNC_DW_cmp_15'
  Mapping 'SYNC_DW_cmp_16'
  Mapping 'SYNC_DW_cmp_17'
  Mapping 'SYNC_DW_cmp_18'
  Mapping 'SYNC_DW_cmp_19'
  Mapping 'SYNC_DW_cmp_20'
  Mapping 'SYNC_DW_cmp_21'
  Mapping 'SYNC_DW_cmp_22'
  Mapping 'SYNC_DW_cmp_23'
  Mapping 'SYNC_DW_cmp_24'
  Mapping 'SYNC_DW_cmp_25'
  Mapping 'SYNC_DW_cmp_26'
  Mapping 'LOG_0_DW_rightsh_0'
Information: Added key list 'DesignWare' to design 'LOG_0'. (DDB-72)
  Processing 'LOG_0_DW01_sub_0'
  Processing 'EXPAND_0_DW01_sub_0'
  Mapping 'G711_0_DW_leftsh_0'
Information: Added key list 'DesignWare' to design 'G711_0'. (DDB-72)
  Processing 'G711_0_DW01_sub_0'
  Mapping 'G711_0_DW_leftsh_1'
  Mapping 'G711_0_DW_cmp_0'
  Processing 'G711_0_DW01_add_0'
  Processing 'COMPRESS_DW01_dec_0'
  Processing 'COMPRESS_DW01_inc_0'
  Processing 'COMPRESS_DW01_sub_0'
  Processing 'IG711_DW01_add_0'
  Mapping 'IG711_DW_cmp_0'
  Processing 'MIX_0_DW01_add_0'
  Processing 'MIX_0_DW01_sub_0'
  Processing 'FILTE_0_DW01_add_0'
  Processing 'FILTE_0_DW01_sub_0'
  Processing 'LIMB_0_DW01_add_0'
  Processing 'LIMB_0_DW01_add_1'
  Mapping 'SUBTC_0_DW_cmp_0'
  Mapping 'SUBTC_0_DW_cmp_1'
  Processing 'SUBTC_0_DW01_sub_0'
  Mapping 'TRANS_0_DW_cmp_0'
  Processing 'TRANS_0_DW01_add_0'
  Mapping 'TRANS_0_DW_leftsh_0'
  Mapping 'TONE_0_DW_cmp_0'
  Processing 'FMULT_ACCUM_0_DW01_inc_0'
  Mapping 'FMULT_ACCUM_0_DW_cmp_0'
  Processing 'FMULT_0_DW01_sub_0'
  Mapping 'FMULT_0_DW_leftsh_0'
Information: Added key list 'DesignWare' to design 'FMULT_0'. (DDB-72)
  Processing 'FMULT_0_DW01_sub_1'
  Mapping 'FMULT_0_DW_rightsh_0'
  Processing 'FMULT_0_DW01_sub_2'
  Mapping 'FMULT_0_DW_cmp_0'
  Processing 'FMULT_0_DW01_add_0'
  Processing 'FMULT_0_DW01_add_1'
  Mapping 'FMULT_0_DW_rightsh_1'
  Processing 'FMULT_0_DW01_sub_3'
  Mapping 'LIMD_0_DW_cmp_0'
  Mapping 'LIMD_0_DW_cmp_1'
  Processing 'LIMD_0_DW01_sub_0'
  Processing 'LIMD_0_DW01_sub_1'
  Processing 'UPA1_0_DW01_sub_0'
  Mapping 'LIMC_0_DW_cmp_0'
  Mapping 'LIMC_0_DW_cmp_1'
  Processing 'UPA2_0_DW01_sub_0'
  Processing 'UPA2_0_DW01_add_0'
  Processing 'UPA2_0_DW01_add_1'
  Processing 'UPA2_0_DW01_sub_1'
  Mapping 'UPA2_0_DW_cmp_0'
  Mapping 'UPA2_0_DW_cmp_1'
  Processing 'UPB_0_DW01_sub_0'
  Processing 'UPB_0_DW01_sub_1'
  Processing 'UPB_1_DW01_sub_0'
  Processing 'UPB_1_DW01_sub_1'
  Processing 'UPB_2_DW01_sub_0'
  Processing 'UPB_2_DW01_sub_1'
  Processing 'UPB_3_DW01_sub_0'
  Processing 'UPB_3_DW01_sub_1'
  Processing 'UPB_4_DW01_sub_0'
  Processing 'UPB_4_DW01_sub_1'
  Processing 'UPB_5_DW01_sub_0'
  Processing 'UPB_5_DW01_sub_1'
  Mapping 'FLOATA_0_DW_rightsh_0'
Information: Added key list 'DesignWare' to design 'FLOATA_0'. (DDB-72)
  Mapping 'FLOATB_0_DW_rightsh_0'
Information: Added key list 'DesignWare' to design 'FLOATB_0'. (DDB-72)
  Processing 'FLOATB_0_DW01_sub_0'
  Processing 'ADDB_0_DW01_add_0'
  Processing 'ADDB_0_DW01_sub_0'
  Processing 'ADDC_0_DW01_add_0'
  Processing 'ADDC_0_DW01_sub_0'
  Mapping 'ANTILOG_0_DW_rightsh_0'
Information: Added key list 'DesignWare' to design 'ANTILOG_0'. (DDB-72)
  Processing 'ANTILOG_0_DW01_sub_0'
  Processing 'ADDA_0_DW01_add_0'
  Processing 'CLOCK_GEN_1_DW01_inc_0'
  Processing 'CU_1_DW01_inc_0'
  Mapping 'CU_1_DW_cmp_0'
  Processing 'CU_1_DW01_inc_1'
  Mapping 'TRANS_1_DW_cmp_0'
  Processing 'TRANS_1_DW01_add_0'
  Mapping 'TRANS_1_DW_leftsh_0'
  Mapping 'TONE_1_DW_cmp_0'
  Mapping 'SUBTC_1_DW_cmp_0'
  Mapping 'SUBTC_1_DW_cmp_1'
  Processing 'SUBTC_1_DW01_sub_0'
  Processing 'MIX_1_DW01_add_0'
  Processing 'MIX_1_DW01_sub_0'
  Processing 'FILTE_1_DW01_add_0'
  Processing 'FILTE_1_DW01_sub_0'
  Processing 'LIMB_1_DW01_add_0'
  Processing 'LIMB_1_DW01_add_1'
  Processing 'FMULT_ACCUM_1_DW01_inc_0'
  Mapping 'FMULT_ACCUM_1_DW_cmp_0'
  Processing 'FMULT_1_DW01_sub_0'
  Mapping 'FMULT_1_DW_leftsh_0'
Information: Added key list 'DesignWare' to design 'FMULT_1'. (DDB-72)
  Processing 'FMULT_1_DW01_sub_1'
  Mapping 'FMULT_1_DW_rightsh_0'
  Processing 'FMULT_1_DW01_sub_2'
  Mapping 'FMULT_1_DW_cmp_0'
  Processing 'FMULT_1_DW01_add_0'
  Processing 'FMULT_1_DW01_add_1'
  Mapping 'FMULT_1_DW_rightsh_1'
  Processing 'FMULT_1_DW01_sub_3'
  Mapping 'LIMD_1_DW_cmp_0'
  Mapping 'LIMD_1_DW_cmp_1'
  Processing 'LIMD_1_DW01_sub_0'
  Processing 'LIMD_1_DW01_sub_1'
  Processing 'UPA1_1_DW01_sub_0'
  Mapping 'LIMC_1_DW_cmp_0'
  Mapping 'LIMC_1_DW_cmp_1'
  Processing 'UPA2_1_DW01_sub_0'
  Processing 'UPA2_1_DW01_add_0'
  Processing 'UPA2_1_DW01_add_1'
  Processing 'UPA2_1_DW01_sub_1'
  Mapping 'UPA2_1_DW_cmp_0'
  Mapping 'UPA2_1_DW_cmp_1'
  Processing 'UPB_6_DW01_sub_0'
  Processing 'UPB_6_DW01_sub_1'
  Processing 'UPB_7_DW01_sub_0'
  Processing 'UPB_7_DW01_sub_1'
  Processing 'UPB_8_DW01_sub_0'
  Processing 'UPB_8_DW01_sub_1'
  Processing 'UPB_9_DW01_sub_0'
  Processing 'UPB_9_DW01_sub_1'
  Processing 'UPB_10_DW01_sub_0'
  Processing 'UPB_10_DW01_sub_1'
  Processing 'UPB_11_DW01_sub_0'
  Processing 'UPB_11_DW01_sub_1'
  Mapping 'FLOATA_1_DW_rightsh_0'
Information: Added key list 'DesignWare' to design 'FLOATA_1'. (DDB-72)
  Mapping 'FLOATB_1_DW_rightsh_0'
Information: Added key list 'DesignWare' to design 'FLOATB_1'. (DDB-72)
  Processing 'FLOATB_1_DW01_sub_0'
  Processing 'ADDB_1_DW01_add_0'
  Processing 'ADDB_1_DW01_sub_0'
  Processing 'ADDC_1_DW01_add_0'
  Processing 'ADDC_1_DW01_sub_0'
  Mapping 'ANTILOG_1_DW_rightsh_0'
Information: Added key list 'DesignWare' to design 'ANTILOG_1'. (DDB-72)
  Processing 'ANTILOG_1_DW01_sub_0'
  Processing 'ADDA_1_DW01_add_0'
  Mapping 'QUAN_DW_cmp_0'
  Mapping 'QUAN_DW_cmp_1'
  Mapping 'QUAN_DW_cmp_2'
  Mapping 'QUAN_DW_cmp_3'
  Mapping 'QUAN_DW_cmp_4'
  Mapping 'QUAN_DW_cmp_5'
  Mapping 'QUAN_DW_cmp_6'
  Mapping 'QUAN_DW_cmp_7'
  Mapping 'QUAN_DW_cmp_8'
  Mapping 'QUAN_DW_cmp_9'
  Mapping 'QUAN_DW_cmp_10'
  Mapping 'QUAN_DW_cmp_11'
  Mapping 'QUAN_DW_cmp_12'
  Mapping 'QUAN_DW_cmp_13'
  Mapping 'QUAN_DW_cmp_14'
  Mapping 'QUAN_DW_cmp_15'
  Mapping 'QUAN_DW_cmp_16'
  Mapping 'QUAN_DW_cmp_17'
  Mapping 'QUAN_DW_cmp_18'
  Mapping 'QUAN_DW_cmp_19'
  Mapping 'QUAN_DW_cmp_20'
  Mapping 'QUAN_DW_cmp_21'
  Mapping 'QUAN_DW_cmp_22'
  Mapping 'QUAN_DW_cmp_23'
  Mapping 'QUAN_DW_cmp_24'
  Mapping 'QUAN_DW_cmp_25'
  Mapping 'QUAN_DW_cmp_26'
  Mapping 'QUAN_DW_cmp_27'
  Mapping 'QUAN_DW_cmp_28'
  Mapping 'QUAN_DW_cmp_29'
  Mapping 'QUAN_DW_cmp_30'
  Mapping 'QUAN_DW_cmp_31'
  Mapping 'QUAN_DW_cmp_32'
  Mapping 'QUAN_DW_cmp_33'
  Mapping 'QUAN_DW_cmp_34'
  Mapping 'QUAN_DW_cmp_35'
  Mapping 'QUAN_DW_cmp_36'
  Mapping 'QUAN_DW_cmp_37'
  Mapping 'QUAN_DW_cmp_38'
  Mapping 'QUAN_DW_cmp_39'
  Mapping 'QUAN_DW_cmp_40'
  Mapping 'QUAN_DW_cmp_41'
  Mapping 'QUAN_DW_cmp_42'
  Mapping 'QUAN_DW_cmp_43'
  Mapping 'QUAN_DW_cmp_44'
  Mapping 'QUAN_DW_cmp_45'
  Mapping 'QUAN_DW_cmp_46'
  Mapping 'QUAN_DW_cmp_47'
  Mapping 'QUAN_DW_cmp_51'
  Mapping 'QUAN_DW_cmp_52'
  Mapping 'QUAN_DW_cmp_53'
  Mapping 'QUAN_DW_cmp_54'
  Mapping 'QUAN_DW_cmp_55'
  Mapping 'LOG_1_DW_rightsh_0'
Information: Added key list 'DesignWare' to design 'LOG_1'. (DDB-72)
  Processing 'LOG_1_DW01_sub_0'
  Processing 'EXPAND_1_DW01_sub_0'
  Mapping 'G711_1_DW_leftsh_0'
Information: Added key list 'DesignWare' to design 'G711_1'. (DDB-72)
  Processing 'G711_1_DW01_sub_0'
  Mapping 'G711_1_DW_leftsh_1'
  Mapping 'G711_1_DW_cmp_0'
  Processing 'G711_1_DW01_add_0'
Warning: A non-unate path in clock network for clock 'clk'
 from pin 'mcac_dec/idec_CU/U57/Y' is detected. (TIM-052)
  Processing 'MIX_0_DW01_sub_1'
  Processing 'MIX_0_DW01_add_1'
  Processing 'UPA1_0_DW01_sub_1'
  Processing 'UPA1_0_DW01_add_0'
  Processing 'UPA2_0_DW01_sub_2'
  Processing 'UPA2_0_DW01_add_2'
  Processing 'UPB_0_DW01_sub_2'
  Processing 'UPB_0_DW01_add_0'
  Processing 'UPB_0_DW01_sub_3'
  Processing 'UPB_0_DW01_add_1'
  Processing 'UPB_1_DW01_sub_2'
  Processing 'UPB_1_DW01_add_0'
  Processing 'UPB_1_DW01_sub_3'
  Processing 'UPB_1_DW01_add_1'
  Processing 'UPB_2_DW01_sub_2'
  Processing 'UPB_2_DW01_add_0'
  Processing 'UPB_2_DW01_sub_3'
  Processing 'UPB_2_DW01_add_1'
  Processing 'UPB_3_DW01_sub_2'
  Processing 'UPB_3_DW01_add_0'
  Processing 'UPB_3_DW01_sub_3'
  Processing 'UPB_3_DW01_add_1'
  Processing 'UPB_4_DW01_sub_2'
  Processing 'UPB_4_DW01_add_0'
  Processing 'UPB_4_DW01_sub_3'
  Processing 'UPB_4_DW01_add_1'
  Processing 'UPB_5_DW01_sub_2'
  Processing 'UPB_5_DW01_add_0'
  Processing 'UPB_5_DW01_sub_3'
  Processing 'UPB_5_DW01_add_1'
  Processing 'MIX_1_DW01_sub_1'
  Processing 'MIX_1_DW01_add_1'
  Processing 'UPA1_1_DW01_sub_1'
  Processing 'UPA1_1_DW01_add_0'
  Processing 'UPA2_1_DW01_sub_2'
  Processing 'UPA2_1_DW01_add_2'
  Processing 'UPB_6_DW01_sub_2'
  Processing 'UPB_6_DW01_add_0'
  Processing 'UPB_6_DW01_sub_3'
  Processing 'UPB_6_DW01_add_1'
  Processing 'UPB_7_DW01_sub_2'
  Processing 'UPB_7_DW01_add_0'
  Processing 'UPB_7_DW01_sub_3'
  Processing 'UPB_7_DW01_add_1'
  Processing 'UPB_8_DW01_sub_2'
  Processing 'UPB_8_DW01_add_0'
  Processing 'UPB_8_DW01_sub_3'
  Processing 'UPB_8_DW01_add_1'
  Processing 'UPB_9_DW01_sub_2'
  Processing 'UPB_9_DW01_add_0'
  Processing 'UPB_9_DW01_sub_3'
  Processing 'UPB_9_DW01_add_1'
  Processing 'UPB_10_DW01_sub_2'
  Processing 'UPB_10_DW01_add_0'
  Processing 'UPB_10_DW01_sub_3'
  Processing 'UPB_10_DW01_add_1'
  Processing 'UPB_11_DW01_sub_2'
  Processing 'UPB_11_DW01_add_0'
  Processing 'UPB_11_DW01_sub_3'
  Processing 'UPB_11_DW01_add_1'
  Processing 'FILTB_0_DW01_add_0'
  Processing 'FILTB_0_DW01_sub_0'
  Processing 'FILTA_0_DW01_add_0'
  Processing 'FILTA_0_DW01_sub_0'
  Processing 'FILTB_0_DW01_add_1'
  Processing 'FILTB_0_DW01_add_2'
  Processing 'FILTA_0_DW01_add_1'
  Processing 'FILTA_0_DW01_add_2'
  Processing 'SUBTC_0_DW01_sub_1'
  Processing 'SUBTC_0_DW01_add_0'
  Processing 'MIX_0_DW01_sub_2'
  Mapping 'MIX_0_DW_mult_uns_0'
  Processing 'MIX_1_DW01_sub_2'
  Mapping 'MIX_1_DW_mult_uns_0'
  Processing 'SUBTA_1_DW01_add_0'
  Processing 'SUBTA_1_DW01_sub_0'
  Processing 'FILTD_0_DW01_add_0'
  Processing 'FILTD_0_DW01_sub_0'
  Processing 'FILTD_0_DW01_add_1'
  Processing 'FILTD_0_DW01_add_2'
  Processing 'UPB_5_DW01_add_2'
  Processing 'UPB_5_DW01_add_3'
  Processing 'UPB_5_DW01_add_4'
  Processing 'UPB_5_DW01_add_5'
  Processing 'UPB_4_DW01_add_2'
  Processing 'UPB_4_DW01_add_3'
  Processing 'UPB_4_DW01_add_4'
  Processing 'UPB_4_DW01_add_5'
  Processing 'UPB_3_DW01_add_2'
  Processing 'UPB_3_DW01_add_3'
  Processing 'UPB_3_DW01_add_4'
  Processing 'UPB_3_DW01_add_5'
  Processing 'UPB_2_DW01_add_2'
  Processing 'UPB_2_DW01_add_3'
  Processing 'UPB_2_DW01_add_4'
  Processing 'UPB_2_DW01_add_5'
  Processing 'UPB_1_DW01_add_2'
  Processing 'UPB_1_DW01_add_3'
  Processing 'UPB_1_DW01_add_4'
  Processing 'UPB_1_DW01_add_5'
  Processing 'UPB_0_DW01_add_2'
  Processing 'UPB_0_DW01_add_3'
  Processing 'UPB_0_DW01_add_4'
  Processing 'UPB_0_DW01_add_5'
  Processing 'FILTE_0_DW01_add_1'
  Processing 'FILTE_0_DW01_add_2'
  Processing 'SUBTB_1_DW01_add_0'
  Processing 'SUBTB_1_DW01_sub_0'
  Processing 'UPA1_0_DW01_add_1'
  Processing 'UPA1_0_DW01_add_2'
  Processing 'UPA2_0_DW01_add_3'
  Processing 'UPA2_0_DW01_add_4'
  Processing 'FILTB_1_DW01_add_0'
  Processing 'FILTB_1_DW01_sub_0'
  Processing 'FILTA_1_DW01_add_0'
  Processing 'FILTA_1_DW01_sub_0'
  Processing 'FILTB_1_DW01_add_1'
  Processing 'FILTB_1_DW01_add_2'
  Processing 'FILTA_1_DW01_add_1'
  Processing 'FILTA_1_DW01_add_2'
  Processing 'FILTD_1_DW01_add_0'
  Processing 'FILTD_1_DW01_sub_0'
  Processing 'FILTD_1_DW01_add_1'
  Processing 'FILTD_1_DW01_add_2'
  Processing 'SUBTC_1_DW01_sub_1'
  Processing 'SUBTC_1_DW01_add_0'
  Processing 'FILTC_0_DW01_add_0'
  Processing 'FILTC_0_DW01_sub_0'
  Processing 'FILTC_0_DW01_add_1'
  Processing 'FILTC_0_DW01_add_2'
  Processing 'FILTE_1_DW01_add_1'
  Processing 'FILTE_1_DW01_add_2'
  Processing 'UPB_10_DW01_add_2'
  Processing 'UPB_10_DW01_add_3'
  Processing 'UPB_10_DW01_add_4'
  Processing 'UPB_10_DW01_add_5'
  Processing 'UPB_9_DW01_add_2'
  Processing 'UPB_9_DW01_add_3'
  Processing 'UPB_9_DW01_add_4'
  Processing 'UPB_9_DW01_add_5'
  Processing 'UPB_8_DW01_add_2'
  Processing 'UPB_8_DW01_add_3'
  Processing 'UPB_8_DW01_add_4'
  Processing 'UPB_8_DW01_add_5'
  Processing 'UPB_7_DW01_add_2'
  Processing 'UPB_7_DW01_add_3'
  Processing 'UPB_7_DW01_add_4'
  Processing 'UPB_7_DW01_add_5'
  Processing 'UPB_6_DW01_add_2'
  Processing 'UPB_6_DW01_add_3'
  Processing 'UPB_6_DW01_add_4'
  Processing 'UPB_6_DW01_add_5'
  Processing 'UPB_11_DW01_add_2'
  Processing 'UPB_11_DW01_add_3'
  Processing 'UPB_11_DW01_add_4'
  Processing 'UPB_11_DW01_add_5'
  Processing 'SUBTA_0_DW01_add_0'
  Processing 'SUBTA_0_DW01_sub_0'
  Processing 'UPA1_1_DW01_add_1'
  Processing 'UPA1_1_DW01_add_2'
  Processing 'UPA2_1_DW01_add_3'
  Processing 'UPA2_1_DW01_add_4'
  Processing 'SUBTB_0_DW01_add_0'
  Processing 'SUBTB_0_DW01_sub_0'
  Processing 'FILTC_1_DW01_add_0'
  Processing 'FILTC_1_DW01_sub_0'
  Processing 'FILTC_1_DW01_add_1'
  Processing 'FILTC_1_DW01_add_2'
Warning: A non-unate path in clock network for clock 'clk'
 from pin 'mcac_dec/idec_CU/U57/Y' is detected. (TIM-052)

  Beginning Mapping Optimizations  (High effort)
  -------------------------------
Information: Added key list 'DesignWare' to design 'LIMC_0'. (DDB-72)
Information: Added key list 'DesignWare' to design 'UPA2_0'. (DDB-72)
Information: Added key list 'DesignWare' to design 'LIMC_1'. (DDB-72)
Information: Added key list 'DesignWare' to design 'UPA2_1'. (DDB-72)
Information: Added key list 'DesignWare' to design 'QUAN'. (DDB-72)
Information: Added key list 'DesignWare' to design 'CU_0'. (DDB-72)
Information: Added key list 'DesignWare' to design 'IG711'. (DDB-72)
Information: Added key list 'DesignWare' to design 'SUBTC_0'. (DDB-72)
Information: Added key list 'DesignWare' to design 'TONE_0'. (DDB-72)
Information: Added key list 'DesignWare' to design 'LIMD_0'. (DDB-72)
Information: Added key list 'DesignWare' to design 'CU_1'. (DDB-72)
Information: Added key list 'DesignWare' to design 'TONE_1'. (DDB-72)
Information: Added key list 'DesignWare' to design 'SUBTC_1'. (DDB-72)
Information: Added key list 'DesignWare' to design 'LIMD_1'. (DDB-72)
  Mapping Optimization (Phase 1)
  Mapping Optimization (Phase 2)
  Mapping Optimization (Phase 3)
  Mapping Optimization (Phase 4)
  Mapping Optimization (Phase 5)
  Mapping Optimization (Phase 6)
  Mapping Optimization (Phase 7)
  Mapping Optimization (Phase 8)
  Mapping Optimization (Phase 9)
  Mapping Optimization (Phase 10)
  Mapping Optimization (Phase 11)
  Mapping Optimization (Phase 12)
  Mapping Optimization (Phase 13)
  Mapping Optimization (Phase 14)
  Mapping Optimization (Phase 15)
  Mapping Optimization (Phase 16)

   ELAPSED            WORST NEG TOTAL NEG  DESIGN                            
    TIME      AREA      SLACK     SLACK   RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:03:10 1034836.4      8.73     836.9      24.5                          
    0:03:10 1034836.4      8.73     836.9      24.5                          
    0:03:26 1075737.8      0.46      31.7       0.0                          
    0:03:26 1075737.8      0.46      31.7       0.0                          
    0:03:26 1075737.8      0.46      31.7       0.0                          
    0:03:27 1075684.6      0.46      31.4       0.0                          
    0:03:27 1075684.6      0.46      31.4       0.0                          
    0:03:48  622525.8      7.41     702.0       0.0                          
    0:03:54  623606.9      5.32     478.8       0.0                          
    0:03:59  622662.2      4.24     364.9       0.0                          
    0:04:00  622938.3      3.83     336.4       0.0                          
    0:04:01  622841.8      2.86     272.1       0.0                          
    0:04:02  622981.5      2.73     258.3       0.0                          
    0:04:03  623114.6      3.02     264.7       0.0                          
    0:04:03  623300.8      2.45     223.9       0.0                          
    0:04:04  623320.8      2.50     222.8       0.0                          
    0:04:05  623357.4      2.38     220.4       0.0                          
    0:04:05  623447.2      2.33     213.5       0.0                          
    0:04:06  623653.4      2.19     203.0       0.0                          
    0:04:06  623703.3      2.19     186.4       0.0                          
    0:04:06  623819.8      2.11     183.3       0.0                          
    0:04:07  623949.5      1.98     179.0       0.0                          
    0:04:07  624089.2      1.88     148.5       0.0                          
    0:04:07  624112.5      1.87     148.0       0.0                          
    0:04:08  624142.4      1.85     147.7       0.0                          
    0:04:08  624142.4      1.85     147.7       0.0                          
    0:04:08  624142.4      1.85     147.7       0.0                          
    0:04:08  624142.4      1.85     147.7       0.0                          
    0:04:08  624142.4      1.85     147.7       0.0                          
    0:04:08  624142.4      1.85     147.7       0.0                          
    0:04:08  624142.4      1.85     147.7       0.0                          
    0:04:11  624634.7      1.08     102.4       0.0 mcac_dec/dec_rf/reg_w_reg[52]/D
    0:04:13  625193.6      0.77      73.1       0.0 mcac_dec/dec_rf/reg_w_reg[52]/D
    0:04:15  625636.0      0.46      38.4       0.0                          
    0:04:16  626025.2      0.46      21.5       0.0                          
    0:04:18  626450.9      0.46      10.7       0.0                          
    0:04:19  626757.0      0.46       4.0       0.0                          
    0:04:20  626743.7      0.46       3.6       0.0                          



  Beginning Delay Optimization Phase
  ----------------------------------

   ELAPSED            WORST NEG TOTAL NEG  DESIGN                            
    TIME      AREA      SLACK     SLACK   RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:04:20  626743.7      0.46       3.6       0.0                          
    0:04:21  626943.2      0.46       3.6       0.0 enc_i_fs                 
    0:04:22  626986.5      0.44       3.5       0.0 dec_s_clk                
Warning: A non-unate path in clock network for clock 'clk'
 from pin 'mcac_dec/idec_CU/*cell*86658/Y' is detected. (TIM-052)
Warning: A non-unate path in clock network for clock 'clk'
 from pin 'mcac_dec/idec_CU/*cell*86658/Y' is detected. (TIM-052)
    0:04:25  627036.4      0.44       3.5       0.0                          
    0:04:27  626943.2      0.44       7.7       0.0                          
    0:04:28  626923.3      0.44       7.7       0.0                          


  Beginning Critical Range Optimization
  -------------------------------------

   ELAPSED            WORST NEG TOTAL NEG  DESIGN                            
    TIME      AREA      SLACK     SLACK   RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:04:28  626923.3      0.44       7.7       0.0                          
    0:04:29  626920.0      0.44       3.5       0.0                          


  Beginning Area-Recovery Phase  (max_area 0)
  -----------------------------

   ELAPSED            WORST NEG TOTAL NEG  DESIGN                            
    TIME      AREA      SLACK     SLACK   RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:04:29  626920.0      0.44       3.5       0.0                          
    0:04:29  626920.0      0.44       3.5       0.0                          
    0:04:32  623324.1      0.44       8.0       0.0                          
    0:04:33  622186.5      0.44       9.1       0.0                          
    0:04:33  621494.6      0.44      10.6       0.0                          
    0:04:34  621195.2      0.44      10.6       0.0                          
    0:04:34  621022.3      0.44      10.6       0.0                          
    0:04:34  620849.3      0.44      10.6       0.0                          
    0:04:35  620683.0      0.44      10.6       0.0                          
    0:04:35  620510.0      0.44      10.7       0.0                          
    0:04:35  620363.6      0.44      10.7       0.0                          
    0:04:36  620160.7      0.44      10.7       0.0                          
    0:04:36  620027.7      0.44      10.8       0.0                          
    0:04:36  619894.6      0.44      10.8       0.0                          
    0:04:36  619774.9      0.44      10.8       0.0                          
    0:04:36  619734.9      0.44      10.8       0.0                          
    0:04:37  619695.0      0.44      10.8       0.0                          
    0:04:37  619655.1      0.44      10.8       0.0                          
    0:04:37  619655.1      0.44      10.8       0.0                          
    0:04:38  619871.3      0.44       3.9       0.0                          
    0:04:39  619934.5      0.44       3.5       0.0                          
    0:04:40  611685.0      1.73     167.8       0.0                          
    0:04:41  610307.9      1.61     156.5       0.0                          
    0:04:42  609735.8      1.56     151.9       0.0                          
    0:04:42  609436.4      1.54     149.6       0.0                          
    0:04:42  609399.8      1.54     149.6       0.0                          
    0:04:42  609399.8      1.54     149.6       0.0                          
    0:04:42  609399.8      1.54     149.6       0.0                          
    0:04:42  609399.8      1.54     149.6       0.0                          
    0:04:44  610347.8      0.77      75.0       0.0 mcac_dec/dec_rf/reg_w_reg[52]/D
    0:04:47  610900.0      0.54      53.9       0.0 mcac_enc/iadap_pred_rec/delay6/delay0_reg[13]/D
    0:04:48  611246.0      0.44      44.2       0.0                          
    0:04:50  611675.1      0.44      29.5       0.0                          
    0:04:51  612376.9      0.44      15.6       0.0                          
    0:04:53  612776.1      0.44      11.2       0.0                          
    0:04:54  613052.2      0.44       6.9       0.0                          
    0:04:56  613468.0      0.44       3.6       0.0                          
    0:04:57  612829.3      0.44       3.5       0.0                          
    0:04:58  611665.1      0.44       3.5       0.0                          
    0:04:58  610913.3      0.44       3.5       0.0                          
    0:04:59  610737.0      0.44       3.5       0.0                          
    0:04:59  610297.9      0.44       3.5       0.0                          
    0:04:59  610038.5      0.44       3.5       0.0                          
    0:05:00  609596.1      0.44       3.5       0.0                          
    0:05:00  609316.7      0.44       3.5       0.0                          
    0:05:01  609206.9      0.44       3.5       0.0                          
    0:05:02  608984.0      0.44       3.5       0.0                          
    0:05:03  608954.1      0.44       3.5       0.0                          
    0:05:04  608927.5      0.44       3.5       0.0                          
    0:05:05  604353.7      1.52     125.7       0.0                          
    0:05:05  603485.5      1.44     120.0       0.0                          
    0:05:06  603029.8      1.35     113.7       0.0                          
    0:05:06  602996.5      1.35     113.7       0.0                          
    0:05:06  602996.5      1.35     113.7       0.0                          
    0:05:06  602996.5      1.35     113.7       0.0                          
    0:05:06  602996.5      1.35     113.7       0.0                          
    0:05:06  602996.5      1.35     113.7       0.0                          
    0:05:08  603761.6      0.62      55.0       0.0 mcac_enc/iadap_pred_rec/delay6/delay0_reg[5]/D
    0:05:10  604197.3      0.44      38.0       0.0                          
    0:05:12  604766.1      0.44      23.5       0.0                          
    0:05:14  605238.5      0.44      13.5       0.0                          
    0:05:16  605684.2      0.44       4.9       0.0                          
    0:05:18  606000.2      0.44       3.5       0.0                          
    0:05:34  605201.9      0.44       4.6       0.0                          
    0:05:39  604666.3      0.44       3.5       0.0                          
    0:05:44  604087.6      0.44       6.1       0.0                          
    0:05:48  603814.8      0.44       4.3       0.0                          
    0:05:52  603545.3      0.44       4.0       0.0                          
    0:05:54  603186.1      0.44       4.4       0.0                          
    0:05:57  602973.2      0.44       3.7       0.0                          
    0:05:58  602667.2      0.44       3.6       0.0                          
    0:06:01  602504.2      0.44       4.2       0.0                          
    0:06:03  602331.2      0.44       4.4       0.0                          
    0:06:04  602168.2      0.44       3.6       0.0                          
    0:06:06  601895.5      0.44       5.3       0.0                          
    0:06:07  601759.1      0.44       5.2       0.0                          
    0:06:08  601626.0      0.44       4.7       0.0                          
    0:06:09  601532.9      0.44       4.5       0.0                          
    0:06:10  601419.8      0.44       4.4       0.0                          
    0:06:10  601419.8      0.44       4.4       0.0                          
    0:06:10  601419.8      0.44       4.4       0.0                          
    0:06:11  599517.1      0.72      57.6       0.0                          
    0:06:11  599307.5      0.72      53.2       0.0                          
    0:06:11  599277.6      0.72      53.2       0.0                          
    0:06:11  599277.6      0.72      53.2       0.0                          
    0:06:11  599277.6      0.72      53.2       0.0                          
    0:06:11  599277.6      0.72      53.2       0.0                          
    0:06:11  599277.6      0.72      53.2       0.0                          
    0:06:11  599277.6      0.72      53.2       0.0                          
    0:06:13  599803.1      0.44      25.0       0.0                          
    0:06:14  600372.0      0.44      13.6       0.0                          
    0:06:16  600937.5      0.44       7.5       0.0                          
    0:06:17  601313.3      0.44       4.1       0.0                          
    0:06:17  601300.0      0.44       3.5       0.0                          


  Beginning Critical Range Optimization
  -------------------------------------

   ELAPSED            WORST NEG TOTAL NEG  DESIGN                            
    TIME      AREA      SLACK     SLACK   RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:06:17  601300.0      0.44       3.5       0.0                          
    0:06:18  601300.0      0.44       3.5       0.0                          
Loading db file '/classes/eeee720/maieee/lib/tsmc-0.18/synopsys/typical.db'

  Optimization Complete
  ---------------------
Warning: Design 'mcac' contains 2 high-fanout nets. A fanout number of 1000 will be used for delay calculations involving these nets. (TIM-134)
     Net 'mcac_enc/iadap_pred_rec/delay6/clk': 2296 load(s), 1 driver(s)
     Net 'mcac_dec/top_dec_TON_TRAN_DET/ton_tran_det_DELAY/clk': 2296 load(s), 1 driver(s)
Information: Defining new variable 'compile_group_pull_control_logic'. (CMD-041)
1
dc_shell> Current design is 'mcac'.
{mcac}
Warning: The specified replacement character (_) is conflicting with the specified allowed or restricted character.   (UCN-4)
Warning: In the design ANTILOG_1, net 'DQS' is connecting multiple ports. (UCN-1)
Warning: In the design FLOATA_1, net 'DQ[15]' is connecting multiple ports. (UCN-1)
Warning: In the design LIMC_1, net 'A2T[15]' is connecting multiple ports. (UCN-1)
Warning: In the design LIMD_1, net 'A1T[15]' is connecting multiple ports. (UCN-1)
Warning: In the design LIMA_1, net 'AP[8]' is connecting multiple ports. (UCN-1)
Warning: In the design ANTILOG_0, net 'DQS' is connecting multiple ports. (UCN-1)
Warning: In the design FLOATA_0, net 'DQ[15]' is connecting multiple ports. (UCN-1)
Warning: In the design LIMA_0, net 'AP[8]' is connecting multiple ports. (UCN-1)
Warning: In the design LIMC_0, net 'A2P[14]' is connecting multiple ports. (UCN-1)
Warning: In the design SUBTC_0_DW01_sub_1, net 'B[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_5_DW01_add_2, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_5_DW01_add_2, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_5_DW01_add_2, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_5_DW01_add_2, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_5_DW01_add_2, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_5_DW01_add_2, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_5_DW01_add_2, net 'A[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_5_DW01_add_4, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_5_DW01_add_4, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_5_DW01_add_4, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_5_DW01_add_4, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_5_DW01_add_4, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_5_DW01_add_4, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_5_DW01_add_4, net 'A[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_4_DW01_add_2, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_4_DW01_add_2, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_4_DW01_add_2, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_4_DW01_add_2, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_4_DW01_add_2, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_4_DW01_add_2, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_4_DW01_add_2, net 'A[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_4_DW01_add_4, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_4_DW01_add_4, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_4_DW01_add_4, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_4_DW01_add_4, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_4_DW01_add_4, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_4_DW01_add_4, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_4_DW01_add_4, net 'A[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_3_DW01_add_2, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_3_DW01_add_2, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_3_DW01_add_2, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_3_DW01_add_2, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_3_DW01_add_2, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_3_DW01_add_2, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_3_DW01_add_2, net 'A[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_3_DW01_add_4, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_3_DW01_add_4, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_3_DW01_add_4, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_3_DW01_add_4, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_3_DW01_add_4, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_3_DW01_add_4, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_3_DW01_add_4, net 'A[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_2_DW01_add_2, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_2_DW01_add_2, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_2_DW01_add_2, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_2_DW01_add_2, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_2_DW01_add_2, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_2_DW01_add_2, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_2_DW01_add_2, net 'A[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_2_DW01_add_4, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_2_DW01_add_4, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_2_DW01_add_4, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_2_DW01_add_4, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_2_DW01_add_4, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_2_DW01_add_4, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_2_DW01_add_4, net 'A[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_1_DW01_add_2, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_1_DW01_add_2, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_1_DW01_add_2, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_1_DW01_add_2, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_1_DW01_add_2, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_1_DW01_add_2, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_1_DW01_add_2, net 'A[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_1_DW01_add_4, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_1_DW01_add_4, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_1_DW01_add_4, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_1_DW01_add_4, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_1_DW01_add_4, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_1_DW01_add_4, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_1_DW01_add_4, net 'A[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_0_DW01_add_2, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_0_DW01_add_2, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_0_DW01_add_2, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_0_DW01_add_2, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_0_DW01_add_2, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_0_DW01_add_2, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_0_DW01_add_2, net 'A[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_0_DW01_add_4, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_0_DW01_add_4, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_0_DW01_add_4, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_0_DW01_add_4, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_0_DW01_add_4, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_0_DW01_add_4, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_0_DW01_add_4, net 'A[0]' is connecting multiple ports. (UCN-1)
Warning: In the design SUBTC_1_DW01_sub_1, net 'B[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_10_DW01_add_2, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_10_DW01_add_2, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_10_DW01_add_2, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_10_DW01_add_2, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_10_DW01_add_2, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_10_DW01_add_2, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_10_DW01_add_2, net 'A[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_10_DW01_add_4, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_10_DW01_add_4, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_10_DW01_add_4, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_10_DW01_add_4, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_10_DW01_add_4, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_10_DW01_add_4, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_10_DW01_add_4, net 'A[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_9_DW01_add_2, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_9_DW01_add_2, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_9_DW01_add_2, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_9_DW01_add_2, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_9_DW01_add_2, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_9_DW01_add_2, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_9_DW01_add_2, net 'A[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_9_DW01_add_4, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_9_DW01_add_4, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_9_DW01_add_4, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_9_DW01_add_4, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_9_DW01_add_4, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_9_DW01_add_4, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_9_DW01_add_4, net 'A[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_8_DW01_add_2, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_8_DW01_add_2, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_8_DW01_add_2, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_8_DW01_add_2, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_8_DW01_add_2, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_8_DW01_add_2, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_8_DW01_add_2, net 'A[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_8_DW01_add_4, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_8_DW01_add_4, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_8_DW01_add_4, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_8_DW01_add_4, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_8_DW01_add_4, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_8_DW01_add_4, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_8_DW01_add_4, net 'A[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_7_DW01_add_2, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_7_DW01_add_2, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_7_DW01_add_2, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_7_DW01_add_2, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_7_DW01_add_2, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_7_DW01_add_2, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_7_DW01_add_2, net 'A[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_7_DW01_add_4, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_7_DW01_add_4, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_7_DW01_add_4, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_7_DW01_add_4, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_7_DW01_add_4, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_7_DW01_add_4, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_7_DW01_add_4, net 'A[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_6_DW01_add_2, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_6_DW01_add_2, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_6_DW01_add_2, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_6_DW01_add_2, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_6_DW01_add_2, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_6_DW01_add_2, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_6_DW01_add_2, net 'A[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_6_DW01_add_4, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_6_DW01_add_4, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_6_DW01_add_4, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_6_DW01_add_4, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_6_DW01_add_4, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_6_DW01_add_4, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_6_DW01_add_4, net 'A[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_11_DW01_add_2, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_11_DW01_add_2, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_11_DW01_add_2, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_11_DW01_add_2, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_11_DW01_add_2, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_11_DW01_add_2, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_11_DW01_add_2, net 'A[0]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_11_DW01_add_4, net 'A[6]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_11_DW01_add_4, net 'A[5]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_11_DW01_add_4, net 'A[4]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_11_DW01_add_4, net 'A[3]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_11_DW01_add_4, net 'A[2]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_11_DW01_add_4, net 'A[1]' is connecting multiple ports. (UCN-1)
Warning: In the design UPB_11_DW01_add_4, net 'A[0]' is connecting multiple ports. (UCN-1)
dc_shell> 1
dc_shell> Current design is 'mcac'.
{mcac}
dc_shell> Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Warning: Verilog writer has added 1 nets to module SUBTA_1 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog writer has added 1 nets to module SUBTB_1 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog writer has added 1 nets to module ADDA_1 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog writer has added 6 nets to module FILTD_1 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog writer has added 2 nets to module FILTE_1 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog writer has added 9 nets to module MIX_1 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog writer has added 1 nets to module FILTA_1 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog writer has added 1 nets to module SUBTC_1 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog writer has added 1 nets to module TRANS_1 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog writer has added 1 nets to module ADDA_0 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog writer has added 1 nets to module TRANS_0 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog writer has added 1 nets to module FILTA_0 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog writer has added 1 nets to module SUBTC_0 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog writer has added 6 nets to module FILTD_0 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog writer has added 2 nets to module FILTE_0 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog writer has added 9 nets to module MIX_0 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog writer has added 4 nets to module COMPRESS using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog writer has added 1 nets to module SUBTA_0 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog writer has added 1 nets to module SUBTB_0 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog writer has added 3 nets to module dec using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
1
Information: Annotated 'cell' delays are assumed to include load delay. (UID-282)
Information: Writing timing information to file '/home/pi4810/eeee720/proj/mcac_bs/mcac/sdf/mcac_tsmc18_rtl.sdf'. (WT-3)
dc_shell> 1
dc_shell> Current design is 'mcac'.
{mcac}
Information: Defining new variable 'hier_dir'. (CMD-041)
dc_shell> ./netlist/mcac_tsmc18_rtl/
dc_shell> Current design is 'mcac'.
{mcac}
dc_shell> Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/mcac.vs'.
1
dc_shell> Current design is 'dec'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/dec.vs'.
Warning: Verilog writer has added 3 nets to module dec using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Current design is 'RF_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/RF_0.vs'.
Current design is 'CLOCK_GEN_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/CLOCK_GEN_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'CLOCK_GEN_0_DW01_inc_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/CLOCK_GEN_0_DW01_inc_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'CU_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/CU_0.vs'.
Current design is 'OUT_PCM'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/OUT_PCM.vs'.
Current design is 'SYNC'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/SYNC.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'SYNC_DW01_inc_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/SYNC_DW01_inc_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'SYNC_DW01_inc_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/SYNC_DW01_inc_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'SUBTB_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/SUBTB_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Warning: Verilog writer has added 1 nets to module SUBTB_0 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Current design is 'SUBTB_0_DW01_add_2'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/SUBTB_0_DW01_add_2.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'LOG_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/LOG_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'SUBTA_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/SUBTA_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Warning: Verilog writer has added 1 nets to module SUBTA_0 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Current design is 'SUBTA_0_DW01_add_5'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/SUBTA_0_DW01_add_5.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'EXPAND_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/EXPAND_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'G711_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/G711_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'COMPRESS'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/COMPRESS.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Warning: Verilog writer has added 4 nets to module COMPRESS using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Current design is 'COMPRESS_DW01_inc_7'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/COMPRESS_DW01_inc_7.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'COMPRESS_DW01_dec_8'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/COMPRESS_DW01_dec_8.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'IG711'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/IG711.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'QUAN_SCAL_FAC_ADAP_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/QUAN_SCAL_FAC_ADAP_0.vs'.
Current design is 'MIX_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/MIX_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Warning: Verilog writer has added 9 nets to module MIX_0 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Current design is 'MIX_0_DW_mult_uns_7'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/MIX_0_DW_mult_uns_7.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'MIX_0_DW01_add_10'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/MIX_0_DW01_add_10.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'MIX_0_DW01_sub_3'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/MIX_0_DW01_sub_3.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'DELAY_08800_19_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_08800_19_0.vs'.
Current design is 'FILTE_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTE_0.vs'.
Warning: Verilog writer has added 2 nets to module FILTE_0 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Current design is 'FILTE_0_DW01_add_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTE_0_DW01_add_1.vs'.
Current design is 'FILTE_0_DW01_add_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTE_0_DW01_add_0.vs'.
Current design is 'DELAY_0220_13_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_0220_13_0.vs'.
Current design is 'LIMB_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/LIMB_0.vs'.
Current design is 'FILTD_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTD_0.vs'.
Warning: Verilog writer has added 6 nets to module FILTD_0 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'FILTD_0_DW01_add_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTD_0_DW01_add_0.vs'.
Current design is 'FILTD_0_DW01_add_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTD_0_DW01_add_1.vs'.
Current design is 'FUNCTW_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FUNCTW_0.vs'.
Current design is 'ADAP_SPED_CTL_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/ADAP_SPED_CTL_0.vs'.
Current design is 'DELAY_RESET_STATE0_WIDTH10_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH10_0.vs'.
Current design is 'LIMA_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/LIMA_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'TRIGA_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRIGA_0.vs'.
Current design is 'FILTC_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTC_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'FILTC_0_DW01_add_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTC_0_DW01_add_1.vs'.
Current design is 'SUBTC_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/SUBTC_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Warning: Verilog writer has added 1 nets to module SUBTC_0 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Current design is 'SUBTC_0_DW01_sub_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/SUBTC_0_DW01_sub_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'DELAY_RESET_STATE0_WIDTH14_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH14_0.vs'.
Current design is 'FILTB_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTB_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'FILTB_0_DW01_add_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTB_0_DW01_add_1.vs'.
Current design is 'DELAY_RESET_STATE0_WIDTH12_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH12_0.vs'.
Current design is 'FILTA_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTA_0.vs'.
Warning: Verilog writer has added 1 nets to module FILTA_0 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'FILTA_0_DW01_add_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTA_0_DW01_add_1.vs'.
Current design is 'FUNCTF_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FUNCTF_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'TON_TRAN_DET_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TON_TRAN_DET_0.vs'.
Current design is 'TRANS_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRANS_0.vs'.
Warning: Verilog writer has added 1 nets to module TRANS_0 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'TRANS_0_DW01_add_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRANS_0_DW01_add_0.vs'.
Current design is 'DELAY_WIDTH1_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_WIDTH1_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'TRIGB_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRIGB_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'TONE_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TONE_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'ADAP_PRED_REC_SIG_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/ADAP_PRED_REC_SIG_0.vs'.
Current design is 'FMULT_ACCUM_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FMULT_ACCUM_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'FMULT_ACCUM_0_DW01_inc_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FMULT_ACCUM_0_DW01_inc_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'ACCUM_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/ACCUM_0.vs'.
Current design is 'FMULT_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FMULT_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'FMULT_0_DW01_add_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FMULT_0_DW01_add_1.vs'.
Current design is 'DELAY_RESET_STATE0_WIDTH16_12'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH16_12.vs'.
Current design is 'TRIGB_WIDTH16_12'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRIGB_WIDTH16_12.vs'.
Current design is 'LIMD_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/LIMD_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPA1_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPA1_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPA1_0_DW01_add_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPA1_0_DW01_add_1.vs'.
Current design is 'DELAY_RESET_STATE0_WIDTH16_13'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH16_13.vs'.
Current design is 'TRIGB_WIDTH16_13'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRIGB_WIDTH16_13.vs'.
Current design is 'LIMC_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/LIMC_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPA2_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPA2_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPA2_0_DW01_add_3'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPA2_0_DW01_add_3.vs'.
Current design is 'DELAY_020_11_12'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_020_11_12.vs'.
Current design is 'DELAYPREDIC_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAYPREDIC_0.vs'.
Current design is 'DELAY_RESET_STATE0_WIDTH16_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH16_0.vs'.
Current design is 'TRIGB_WIDTH16_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRIGB_WIDTH16_0.vs'.
Current design is 'UPB_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_0_DW01_add_4'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_0_DW01_add_4.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_0_DW01_add_5'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_0_DW01_add_5.vs'.
Current design is 'UPB_0_DW01_add_2'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_0_DW01_add_2.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_0_DW01_add_3'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_0_DW01_add_3.vs'.
Current design is 'XORA_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/XORA_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'DELAY_020_11_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_020_11_0.vs'.
Current design is 'DELAYPREDIC_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAYPREDIC_1.vs'.
Current design is 'DELAY_RESET_STATE0_WIDTH16_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH16_1.vs'.
Current design is 'TRIGB_WIDTH16_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRIGB_WIDTH16_1.vs'.
Current design is 'UPB_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_1_DW01_add_4'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_1_DW01_add_4.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_1_DW01_add_5'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_1_DW01_add_5.vs'.
Current design is 'UPB_1_DW01_add_2'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_1_DW01_add_2.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_1_DW01_add_3'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_1_DW01_add_3.vs'.
Current design is 'XORA_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/XORA_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'DELAY_020_11_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_020_11_1.vs'.
Current design is 'DELAYPREDIC_2'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAYPREDIC_2.vs'.
Current design is 'DELAY_RESET_STATE0_WIDTH16_2'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH16_2.vs'.
Current design is 'TRIGB_WIDTH16_2'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRIGB_WIDTH16_2.vs'.
Current design is 'UPB_2'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_2.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_2_DW01_add_4'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_2_DW01_add_4.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_2_DW01_add_5'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_2_DW01_add_5.vs'.
Current design is 'UPB_2_DW01_add_2'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_2_DW01_add_2.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_2_DW01_add_3'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_2_DW01_add_3.vs'.
Current design is 'XORA_2'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/XORA_2.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'DELAY_020_11_2'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_020_11_2.vs'.
Current design is 'DELAYPREDIC_3'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAYPREDIC_3.vs'.
Current design is 'DELAY_RESET_STATE0_WIDTH16_3'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH16_3.vs'.
Current design is 'TRIGB_WIDTH16_3'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRIGB_WIDTH16_3.vs'.
Current design is 'UPB_3'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_3.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_3_DW01_add_4'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_3_DW01_add_4.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_3_DW01_add_5'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_3_DW01_add_5.vs'.
Current design is 'UPB_3_DW01_add_2'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_3_DW01_add_2.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_3_DW01_add_3'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_3_DW01_add_3.vs'.
Current design is 'XORA_3'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/XORA_3.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'DELAY_020_11_3'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_020_11_3.vs'.
Current design is 'DELAYPREDIC_4'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAYPREDIC_4.vs'.
Current design is 'DELAY_RESET_STATE0_WIDTH16_4'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH16_4.vs'.
Current design is 'TRIGB_WIDTH16_4'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRIGB_WIDTH16_4.vs'.
Current design is 'UPB_4'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_4.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_4_DW01_add_4'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_4_DW01_add_4.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_4_DW01_add_5'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_4_DW01_add_5.vs'.
Current design is 'UPB_4_DW01_add_2'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_4_DW01_add_2.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_4_DW01_add_3'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_4_DW01_add_3.vs'.
Current design is 'XORA_4'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/XORA_4.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'DELAY_020_11_4'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_020_11_4.vs'.
Current design is 'DELAYPREDIC_5'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAYPREDIC_5.vs'.
Current design is 'DELAY_RESET_STATE0_WIDTH16_5'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH16_5.vs'.
Current design is 'TRIGB_WIDTH16_5'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRIGB_WIDTH16_5.vs'.
Current design is 'UPB_5'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_5.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_5_DW01_add_4'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_5_DW01_add_4.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_5_DW01_add_5'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_5_DW01_add_5.vs'.
Current design is 'UPB_5_DW01_add_2'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_5_DW01_add_2.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_5_DW01_add_3'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_5_DW01_add_3.vs'.
Current design is 'XORA_5'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/XORA_5.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'DELAY_020_11_5'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_020_11_5.vs'.
Current design is 'FLOATA_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FLOATA_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'DELAY_020_11_13'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_020_11_13.vs'.
Current design is 'FLOATB_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FLOATB_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'ADDB_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/ADDB_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'ADDB_0_DW01_add_6'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/ADDB_0_DW01_add_6.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'DELAY_RESET_STATE0_WIDTH1_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH1_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'DELAY_RESET_STATE0_WIDTH1_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH1_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'ADDC_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/ADDC_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'ADDC_0_DW01_add_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/ADDC_0_DW01_add_0.vs'.
Current design is 'I_ADAP_QUAN_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/I_ADAP_QUAN_0.vs'.
Current design is 'ANTILOG_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/ANTILOG_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'ADDA_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/ADDA_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Warning: Verilog writer has added 1 nets to module ADDA_0 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Current design is 'ADDA_0_DW01_add_11'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/ADDA_0_DW01_add_11.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'RECONST_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/RECONST_0.vs'.
Current design is 'IN_REG_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/IN_REG_0.vs'.
Current design is 'enc'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/enc.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'RF_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/RF_1.vs'.
Current design is 'CLOCK_GEN_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/CLOCK_GEN_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'CLOCK_GEN_1_DW01_inc_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/CLOCK_GEN_1_DW01_inc_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'CU_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/CU_1.vs'.
Current design is 'TON_TRAN_DET_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TON_TRAN_DET_1.vs'.
Current design is 'TRANS_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRANS_1.vs'.
Warning: Verilog writer has added 1 nets to module TRANS_1 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'TRANS_1_DW01_add_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRANS_1_DW01_add_0.vs'.
Current design is 'DELAY_WIDTH1_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_WIDTH1_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'TRIGB_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRIGB_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'TONE_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TONE_1.vs'.
Current design is 'ADAP_SPED_CTL_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/ADAP_SPED_CTL_1.vs'.
Current design is 'DELAY_RESET_STATE0_WIDTH10_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH10_1.vs'.
Current design is 'LIMA_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/LIMA_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'TRIGA_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRIGA_1.vs'.
Current design is 'FILTC_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTC_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'FILTC_1_DW01_add_3'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTC_1_DW01_add_3.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'SUBTC_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/SUBTC_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Warning: Verilog writer has added 1 nets to module SUBTC_1 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Current design is 'SUBTC_1_DW01_sub_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/SUBTC_1_DW01_sub_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'DELAY_RESET_STATE0_WIDTH14_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH14_1.vs'.
Current design is 'FILTB_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTB_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'FILTB_1_DW01_add_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTB_1_DW01_add_1.vs'.
Current design is 'DELAY_RESET_STATE0_WIDTH12_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH12_1.vs'.
Current design is 'FILTA_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTA_1.vs'.
Warning: Verilog writer has added 1 nets to module FILTA_1 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'FILTA_1_DW01_add_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTA_1_DW01_add_1.vs'.
Current design is 'FUNCTF_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FUNCTF_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'QUAN_SCAL_FAC_ADAP_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/QUAN_SCAL_FAC_ADAP_1.vs'.
Current design is 'MIX_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/MIX_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Warning: Verilog writer has added 9 nets to module MIX_1 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Current design is 'MIX_1_DW01_sub_3'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/MIX_1_DW01_sub_3.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'MIX_1_DW_mult_uns_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/MIX_1_DW_mult_uns_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'MIX_1_DW01_add_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/MIX_1_DW01_add_0.vs'.
Current design is 'DELAY_08800_19_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_08800_19_1.vs'.
Current design is 'FILTE_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTE_1.vs'.
Warning: Verilog writer has added 2 nets to module FILTE_1 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Current design is 'FILTE_1_DW01_add_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTE_1_DW01_add_1.vs'.
Current design is 'FILTE_1_DW01_add_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTE_1_DW01_add_0.vs'.
Current design is 'DELAY_0220_13_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_0220_13_1.vs'.
Current design is 'LIMB_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/LIMB_1.vs'.
Current design is 'FILTD_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTD_1.vs'.
Warning: Verilog writer has added 6 nets to module FILTD_1 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'FILTD_1_DW01_add_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTD_1_DW01_add_0.vs'.
Current design is 'FILTD_1_DW01_add_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FILTD_1_DW01_add_1.vs'.
Current design is 'FUNCTW_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FUNCTW_1.vs'.
Current design is 'ADAP_PRED_REC_SIG_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/ADAP_PRED_REC_SIG_1.vs'.
Current design is 'FMULT_ACCUM_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FMULT_ACCUM_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'FMULT_ACCUM_1_DW01_inc_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FMULT_ACCUM_1_DW01_inc_0.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'ACCUM_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/ACCUM_1.vs'.
Current design is 'FMULT_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FMULT_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'FMULT_1_DW01_add_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FMULT_1_DW01_add_1.vs'.
Current design is 'DELAY_RESET_STATE0_WIDTH16_14'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH16_14.vs'.
Current design is 'TRIGB_WIDTH16_14'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRIGB_WIDTH16_14.vs'.
Current design is 'LIMD_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/LIMD_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPA1_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPA1_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPA1_1_DW01_add_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPA1_1_DW01_add_1.vs'.
Current design is 'DELAY_RESET_STATE0_WIDTH16_15'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH16_15.vs'.
Current design is 'TRIGB_WIDTH16_15'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRIGB_WIDTH16_15.vs'.
Current design is 'LIMC_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/LIMC_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPA2_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPA2_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPA2_1_DW01_add_11'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPA2_1_DW01_add_11.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'DELAY_020_11_14'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_020_11_14.vs'.
Current design is 'DELAYPREDIC_6'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAYPREDIC_6.vs'.
Current design is 'DELAY_RESET_STATE0_WIDTH16_6'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH16_6.vs'.
Current design is 'TRIGB_WIDTH16_6'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRIGB_WIDTH16_6.vs'.
Current design is 'UPB_6'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_6.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_6_DW01_add_4'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_6_DW01_add_4.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_6_DW01_add_5'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_6_DW01_add_5.vs'.
Current design is 'UPB_6_DW01_add_2'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_6_DW01_add_2.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_6_DW01_add_3'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_6_DW01_add_3.vs'.
Current design is 'XORA_6'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/XORA_6.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'DELAY_020_11_6'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_020_11_6.vs'.
Current design is 'DELAYPREDIC_7'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAYPREDIC_7.vs'.
Current design is 'DELAY_RESET_STATE0_WIDTH16_7'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH16_7.vs'.
Current design is 'TRIGB_WIDTH16_7'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRIGB_WIDTH16_7.vs'.
Current design is 'UPB_7'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_7.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_7_DW01_add_4'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_7_DW01_add_4.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_7_DW01_add_5'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_7_DW01_add_5.vs'.
Current design is 'UPB_7_DW01_add_2'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_7_DW01_add_2.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_7_DW01_add_3'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_7_DW01_add_3.vs'.
Current design is 'XORA_7'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/XORA_7.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'DELAY_020_11_7'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_020_11_7.vs'.
Current design is 'DELAYPREDIC_8'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAYPREDIC_8.vs'.
Current design is 'DELAY_RESET_STATE0_WIDTH16_8'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH16_8.vs'.
Current design is 'TRIGB_WIDTH16_8'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRIGB_WIDTH16_8.vs'.
Current design is 'UPB_8'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_8.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_8_DW01_add_4'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_8_DW01_add_4.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_8_DW01_add_5'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_8_DW01_add_5.vs'.
Current design is 'UPB_8_DW01_add_2'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_8_DW01_add_2.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_8_DW01_add_3'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_8_DW01_add_3.vs'.
Current design is 'XORA_8'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/XORA_8.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'DELAY_020_11_8'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_020_11_8.vs'.
Current design is 'DELAYPREDIC_9'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAYPREDIC_9.vs'.
Current design is 'DELAY_RESET_STATE0_WIDTH16_9'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH16_9.vs'.
Current design is 'TRIGB_WIDTH16_9'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRIGB_WIDTH16_9.vs'.
Current design is 'UPB_9'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_9.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_9_DW01_add_4'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_9_DW01_add_4.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_9_DW01_add_5'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_9_DW01_add_5.vs'.
Current design is 'UPB_9_DW01_add_2'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_9_DW01_add_2.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_9_DW01_add_3'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_9_DW01_add_3.vs'.
Current design is 'XORA_9'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/XORA_9.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'DELAY_020_11_9'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_020_11_9.vs'.
Current design is 'DELAYPREDIC_10'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAYPREDIC_10.vs'.
Current design is 'DELAY_RESET_STATE0_WIDTH16_10'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH16_10.vs'.
Current design is 'TRIGB_WIDTH16_10'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRIGB_WIDTH16_10.vs'.
Current design is 'UPB_10'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_10.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_10_DW01_add_4'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_10_DW01_add_4.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_10_DW01_add_5'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_10_DW01_add_5.vs'.
Current design is 'UPB_10_DW01_add_2'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_10_DW01_add_2.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_10_DW01_add_3'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_10_DW01_add_3.vs'.
Current design is 'XORA_10'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/XORA_10.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'DELAY_020_11_10'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_020_11_10.vs'.
Current design is 'DELAYPREDIC_11'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAYPREDIC_11.vs'.
Current design is 'DELAY_RESET_STATE0_WIDTH16_11'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH16_11.vs'.
Current design is 'TRIGB_WIDTH16_11'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/TRIGB_WIDTH16_11.vs'.
Current design is 'UPB_11'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_11.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_11_DW01_add_2'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_11_DW01_add_2.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_11_DW01_add_3'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_11_DW01_add_3.vs'.
Current design is 'UPB_11_DW01_add_4'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_11_DW01_add_4.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'UPB_11_DW01_add_5'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/UPB_11_DW01_add_5.vs'.
Current design is 'XORA_11'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/XORA_11.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'DELAY_020_11_11'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_020_11_11.vs'.
Current design is 'FLOATA_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FLOATA_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'DELAY_020_11_15'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_020_11_15.vs'.
Current design is 'FLOATB_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/FLOATB_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'ADDB_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/ADDB_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'ADDB_1_DW01_add_0'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/ADDB_1_DW01_add_0.vs'.
Current design is 'DELAY_RESET_STATE0_WIDTH1_2'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH1_2.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'DELAY_RESET_STATE0_WIDTH1_3'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/DELAY_RESET_STATE0_WIDTH1_3.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'ADDC_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/ADDC_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'ADDC_1_DW01_add_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/ADDC_1_DW01_add_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'I_ADAP_QUAN_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/I_ADAP_QUAN_1.vs'.
Current design is 'ANTILOG_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/ANTILOG_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'ADDA_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/ADDA_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Warning: Verilog writer has added 1 nets to module ADDA_1 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Current design is 'ADDA_1_DW01_add_6'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/ADDA_1_DW01_add_6.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'RECONST_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/RECONST_1.vs'.
Current design is 'ADAP_QUAN'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/ADAP_QUAN.vs'.
Current design is 'QUAN'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/QUAN.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'SUBTB_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/SUBTB_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Warning: Verilog writer has added 1 nets to module SUBTB_1 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Current design is 'SUBTB_1_DW01_add_5'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/SUBTB_1_DW01_add_5.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'LOG_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/LOG_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'IN_PCM'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/IN_PCM.vs'.
Current design is 'SUBTA_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/SUBTA_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Warning: Verilog writer has added 1 nets to module SUBTA_1 using SYNOPSYS_UNCONNECTED_ as prefix.  Please use the change_names command to make the correct changes before invoking the verilog writer.  (VO-11)
Current design is 'SUBTA_1_DW01_add_2'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/SUBTA_1_DW01_add_2.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'EXPAND_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/EXPAND_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'G711_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/G711_1.vs'.
Warning: Verilog 'assign' or 'tran' statements are written out. (VO-4)
Current design is 'IN_REG_1'.
Writing verilog file '/home/pi4810/eeee720/proj/mcac_bs/mcac/netlist/mcac_tsmc18_rtl/IN_REG_1.vs'.
Information: Defining new variable 'current_cell'. (CMD-041)
dc_shell> Current design is 'mcac'.
{mcac}
dc_shell> 
Thank you...
